{"id":1402,"date":"2020-09-14T12:28:46","date_gmt":"2020-09-14T12:28:46","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=1402"},"modified":"2022-01-19T15:29:04","modified_gmt":"2022-01-19T15:29:04","slug":"immo-awarded-as-technology-pioneer-by-world-economic-forum","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/immo-awarded-as-technology-pioneer-by-world-economic-forum\/","title":{"rendered":"IMMO Cawarded as Technology Pioneer 2020 by World Economic Forum"},"content":{"rendered":"\n<p>We are delighted to share that IMMO has been named as &#8220;WEF TechPioneer 2020&#8221; for its technology &amp; data-led disruption of the investment process in the residential real estate sector. What is even more exciting is the fact that companies like Airbnb, Google, Kickstarter, Mozilla, Palantir Technologies, Spotify, TransferWise and Twitter, have been past recipients of this award. We are humbled to be within such an illustrious company and to be recognised by the World Economic Forum.<\/p>\n\n\n\n<p>At IMMO, we are reshaping the way institutional investors deploy capital into the residential real estate sector. We digitally source, appraise, and acquire centrally located properties at scale using machine-learning based evaluation and pricing mechanisms. The acquired properties are upgraded and turned into fully-furnished “living as a service” homes targeting the long-term rental market.<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>Following IMMO’s selection as Technology Pioneer, our CEO Hans-Christian Zappel will be invited to participate in World Economic Forum activities, events, and discussions throughout the year. IMMO will also contribute to Forum initiatives over the next two years, working with policymakers and private sector leaders to help define the global agenda on key issues.<\/p><\/blockquote><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\">Leaders Speak<\/h2>\n\n\n\n<p>Speaking on the occasion, Susan Nesbitt, Head of the Global Innovators Community, World Economic Forum, said:<\/p>\n\n\n\n<p><\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>“We’re excited to welcome IMMO to our 20<sup>th<\/sup> cohort of Technology Pioneers, IMMO  and its fellow pioneers are developing cutting edge technologies all over the world. Beyond their innovations, these firms are contributing greatly to improving the state of the world.”<\/em><\/p><cite>Susan Nesbitt, Head of the Global Innovators Community, World Economic Forum<\/cite><\/blockquote>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>Hans-Christian Zappel, CEO, IMMO Capital said:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><strong>“<\/strong>It’s great to be acknowledged as a technology pioneer by the World Economic Forum. Professional investors love residential real estate due to its attractive risk-adjusted returns profile. However, deploying capital at scale is very challenging despite the fact that residential is the largest asset class in the world (€39trillion in Europe alone). Single units account for 94% of all residential real estate transactions, but as valuing and acquiring thousands of single units has so far been practically impossible, investors were restricted to deploying in the empty market of portfolios and multi-family developments. IMMO has built the technology to source, appraise, and acquire single units at scale, thereby opening up a single unit residential real estate as a new investment asset class<strong>.<\/strong><\/p><cite>Hans-Christian Zappel, CEO, IMMO Capital<\/cite><\/blockquote>\n\n\n\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\">More about WEF Technology Pioneers<\/h2>\n\n\n\n<p>The World Economic Forum’s Technology Pioneers are early to growth-stage companies from around the world that are involved in the design, development, and deployment of new technologies and innovations, and are poised to have a significant impact on business and society. The Technology Pioneers Community is an integral part of the larger Global Innovators Community of start-ups at the World Economic Forum.<\/p>\n\n\n\n<p>This year’s cohort selection marks the 20<sup>th<\/sup> anniversary of the Tech Pioneers Community. Throughout its 20-year run, many Technology Pioneers have continuously contributed to advancement in their industries while some have even gone on to become household names.<\/p>\n\n\n\n<p>Tech Pioneer firms are shaping the future by advancing technologies such as AI, IoT, robotics, blockchain, biotechnology, and many more. The diversity of these companies extends to their leadership as well, as over 25% of 2020 Tech Pioneers are female-led. The firms also come from regions all around the world, extending their community far beyond Silicon Valley. The full list of 2020 Technology Pioneers can be found <a rel=\"noreferrer noopener\" href=\"https:\/\/widgets.weforum.org\/techpioneers-2020\/\" target=\"_blank\">here.<\/a><\/p>\n\n\n\n<p>The entire IMMO family is excited to be a part of this journey!  While we make buying, selling, and renting a comfortable, hassle-free experience, recognitions like these keep us motivated to design breakthrough products to create value for our customers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>IMMO has been named as &#8220;WEF TechPioneer 2020&#8221; for its technology &#038; data-led disruption of the investment process in the residential real estate sector.<\/p>\n","protected":false},"featured_media":1403,"parent":0,"template":"","tags":[19],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"1441"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1402"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":1,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1402\/revisions"}],"predecessor-version":[{"id":1953,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1402\/revisions\/1953"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/1403"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=1402"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=1402"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=1402"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}