{"id":1553,"date":"2020-10-07T09:59:49","date_gmt":"2020-10-07T09:59:49","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=1553"},"modified":"2022-01-19T15:32:21","modified_gmt":"2022-01-19T15:32:21","slug":"in-a-zero-yield-world-real-estate-investors-turn-to-proptech-for-alpha","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/in-a-zero-yield-world-real-estate-investors-turn-to-proptech-for-alpha\/","title":{"rendered":"In a zero yield world, real estate investors turn to proptech for alpha"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Unicorn rising&nbsp;<\/h2>\n\n\n\n<p>In recent weeks,&nbsp; Social Capital Hedosophia II, a company led by Chamath Palihapitiya &#8211; venture capitalist, announced that it will merge with Opendoor, taking the US private real estate startup public in the process at an enterprise value of $4.8Billion.<\/p>\n\n\n\n<p>Founded in 2014, Opendoor is the dominant player in the US “iBuying” space, a term used for start-ups that let homeowners rapidly sell their homes to the company, which then lists it on its platform for sale—taking commissions from both the buyer and seller side of the transaction. Opendoor uses data analysis to determine its offered pricing; if it overpays for a home upfront, it could take a loss. If it tries to underpay, sellers will look elsewhere.<\/p>\n\n\n\n<p>Last year Opendoor sold 18,000 homes across 21 markets at an average value of $261,000 per home creating $4.7Billion in turnover in the process. Competition has increased with new iBuyers such as Zillow, Offerpad, and Redfin making up just 0.5% of the $1.6Trillion US home buying market.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The rise of SFR in US<\/h2>\n\n\n\n<p>Outside of major cities, the US housing market is dominated by single-family homes; after the global financial crisis in 2009, housing affordability &amp; home building declined spurring the growth of a new real estate asset class – single-family rental. Over the next decade, institutional real estate asset managers went on to create billion-dollar portfolios of single-family assets to privately rent out to families with the objective of long term income streams, capital growth, and inflation protection.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The European opportunity<\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"alignleft size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"441\" height=\"296\" src=\"https:\/\/immo.capital\/wp-content\/uploads\/2020\/10\/Graph_1.png\" alt=\"\" class=\"wp-image-1555\" srcset=\"https:\/\/immo.capital\/wp-content\/uploads\/2020\/10\/Graph_1.png 441w, https:\/\/immo.capital\/wp-content\/uploads\/2020\/10\/Graph_1-327x219.png 327w\" sizes=\"(max-width: 441px) 100vw, 441px\" \/><\/figure><\/div>\n\n\n\n<p>After the global financial crisis, Europe also went through a cycle of low-interest rates, quantitative easing, and a decline in both affordability and house building stimulating a move to “generation rent”. But unlike the US, Europe has and remains a fragmented real estate market with unique market characteristics and regulations in each nation.<\/p>\n\n\n\n<p>With house price affordability at historic lows, the market continues to see a rise in renting; even top earners are having to save for longer to afford deposits and meet affordability criteria to buy their first home. Top German cities now have 80% renters and a generation comfortable with long term rent. The UK, where the home-owning dream has been a right for generations, has seen the number of renters almost exceed the number of mortgaged homeowners in the last few years, a staggering shift over 20 years that is expected to increase.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Enter IMMO, the next-gen asset manager providing scale and speed<\/h2>\n\n\n\n<p>Unlike Opendoor, IMMO Capital is not concerned with consumer-to-consumer real estate transactions. Uniquely, IMMO Capital has identified the need of institutional investors that need to deploy capital at speed to source large portfolios of diversified residential real estate.&nbsp;<\/p>\n\n\n\n<p>Today, institutional investors target just 2% of the available residential real estate market; that’s because in order to deploy capital at a scale they have to buy multi-family developments, build-to-rent, or secondary portfolio acquisitions; these strategies are expensive, exposed to development or concentration risk, occupy secondary locations, and can take years to generate income.<\/p>\n\n\n\n<p>IMMO inverts the market with state of the art technology to unlock access to 98% of the residential market inaccessible to investors – “Single-Family Rentals ”or “Single Apartment Rentals” (“SFR”). IMMO combines machine learning with local expertise to identify, underwrite, acquire, and aggregate assets into attractively priced, well located, income-generating portfolios fast and at scale. <\/p>\n\n\n\n<p>As an asset manager and operating partner, IMMO helps institutional investors to deploy capital and generate stabilised income at speed and scale, in the best locations without having to wait for years for income. IMMO is the ultimate example of recycling and buying assets from the secondary market, eliminating the 50 cubic tonnes of carbon that is created when a new house is built. <\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>For the first time, institutional real estate demand can be met through the consumer residential secondary real estate market that reduces the carbon footprint of each portfolio.<\/p><\/blockquote><\/figure>\n\n\n\n<p>IMMO has built a standardised data-driven product for the professional real estate market that owns the entire value chain from the capital, underwriting, to consumer engagement, purchasing, lettings, and management.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">IMMO is building the AI landlord of the future <\/h2>\n\n\n\n<p>Based on our machine learning model, we carry out financial underwriting of a property “in a matter of minutes,” a process that when done manually can take days. Our technology finally makes the strategy of “Single Unit” aggregation possible and is the way to connect institutional demand to consumer liquidity.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>IMMO intelligence is the data platform that identifies, prices, and acquires assets at scale; for example IMMO Portfolio I &#8211; Hamburg &#8211;&nbsp; evaluated over 20,000 available properties in prime locations, at a value of €2.3BN in order to acquire 100 properties for a family office portfolio.&nbsp;<\/p><\/blockquote><\/figure>\n\n\n\n<hr class=\"wp-block-separator has-text-color has-background has-gray-cc-background-color has-gray-cc-color is-style-default\"\/>\n\n\n\n<p>IMMO is a next-gen asset manager &amp; operating partner to institutional real estate investors.<\/p>\n\n\n\n<p>IMMO uses AI to source &amp; underwrite single unit\/family homes into large portfolios of stabilised rental income with capital appreciation and active management. IMMO&#8217;s award-winning technology unlocks access to 98% of the residential market currently ignored by institutional investors – single unit assets. No building, no carbon impact, and faster access to stabilised income from rental portfolios in the best locations. <\/p>\n\n\n\n<p>If you’d like to learn more about the next-generation real estate strategy powered by AI, managed by experts then visit us at&nbsp; <a href=\"https:\/\/immo.capital\/?utm_source=blog&amp;utm_medium=how-immo-capital-is-building-the-opendoor-of-europe\">www.immo.capital<\/a>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Unicorn rising&nbsp; In recent weeks,&nbsp; Social Capital Hedosophia II, a company led by Chamath Palihapitiya &#8211; venture capitalist, announced that it will merge with Opendoor, taking the US private real estate startup public in the process at an enterprise value of $4.8Billion. Founded in 2014, Opendoor is the dominant player in the US “iBuying” space, [&hellip;]<\/p>\n","protected":false},"featured_media":473,"parent":0,"template":"","tags":[22,23],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"1441"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1553"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":2,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1553\/revisions"}],"predecessor-version":[{"id":1957,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1553\/revisions\/1957"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/473"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=1553"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=1553"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=1553"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}