{"id":1634,"date":"2021-07-06T14:23:19","date_gmt":"2021-07-06T14:23:19","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=1634"},"modified":"2022-01-19T15:34:25","modified_gmt":"2022-01-19T15:34:25","slug":"leading-real-estate-strategist-prof-andrew-baum-joins-immo-capital","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/leading-real-estate-strategist-prof-andrew-baum-joins-immo-capital\/","title":{"rendered":"Leading real estate strategist, Prof. Andrew Baum joins IMMO"},"content":{"rendered":"\n<p>July 2021 &#8211; We are pleased to announce that Professor Andrew Baum is to join IMMO as a strategic advisor and investor. Andrew joins IMMO as we prepare to lead the unlocking of the Single Family Rental (SFR) market in Europe, with a pipeline to deploy €1.2 billion investment capital, on behalf of some of the largest global investment managers<\/p>\n\n\n\n<p>Andrew is renowned for his role as Professor of Practice at the University of Oxford, where he led the Future of Real Estate Initiatives at the Saïd Business School, which was launched to research and predict future changes to the industry over the next decade, including the impact of innovation and technology.&nbsp; He has balanced his academic career with several prominent private sector roles including chairman of Property Funds Research, an investment advisory firm and Chairman of Newcore Capital Management, a real estate fund manager as well as leadership roles at CBRE Global Investors, Invesco and Grosvenor.<\/p>\n\n\n\n<p>In 2017, Andrew was voted one of the Top 3 most influential people in PropTech, due to his compelling experience across property finance, property development, property funds, proptech and international real estate investment.&nbsp; He recently collaborated with Pi Labs on a whitepaper about Technology and the Future of Real Estate Investment Management.&nbsp; His previous research has included leading a ground-breaking report detailing the dramatic changes facing the real estate industry, PropTech 3.0: The Future of Real Estate which was the most downloaded Oxford Saïd report of that year.<\/p>\n\n\n\n<p>Andrew has unparalleled knowledge of the factors driving both the future of real estate markets and congruent proptech solutions, so we are delighted to have him on board. Andrew&#8217;s advice will be invaluable as we at IMMO Capital seek to unlock a brand-new institutional investment class, the €34 trillion European SFR market. Andrew’s appointment fits well with IMMO’s status as an entirely tech-driven business, which enables us to innovate and introduce new tools and services at a much quicker pace than traditional business models<\/p>\n\n\n\n<p>“I’m delighted to be joining at such an exciting time for IMMO. With excitement growing around the residential sector, including the burgeoning SFR market, there is huge potential to springboard from IMMO’s unique and impressive technology platform to scale up the business very quickly.  With an outstanding founding team, IMMO has a first mover advantage, with no lack of ambition.  I’m looking forward to working alongside IMMO as they deliver on an exciting pipeline of investor partnerships and create a new model for residential investment.”<em> &#8211; <\/em><strong><em>Professor Andrew Baum<\/em><\/strong><\/p>\n\n\n\n<p>&nbsp;<\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>July 2021 &#8211; We are pleased to announce that Professor Andrew Baum is to join IMMO as a strategic advisor and investor. Andrew joins IMMO as we prepare to lead the unlocking of the Single Family Rental (SFR) market in Europe, with a pipeline to deploy €1.2 billion investment capital, on behalf of some of [&hellip;]<\/p>\n","protected":false},"featured_media":1641,"parent":0,"template":"","tags":[19],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"1441"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1634"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":6,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1634\/revisions"}],"predecessor-version":[{"id":1960,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1634\/revisions\/1960"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/1641"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=1634"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=1634"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=1634"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}