{"id":1874,"date":"2021-12-15T13:16:45","date_gmt":"2021-12-15T13:16:45","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=1874"},"modified":"2022-01-19T15:42:36","modified_gmt":"2022-01-19T15:42:36","slug":"why-sfr-could-be-a-much-better-investment-than-btr","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/why-sfr-could-be-a-much-better-investment-than-btr\/","title":{"rendered":"Why SFR could be a much better investment than BTR"},"content":{"rendered":"\n<p>The build-to-rent (BTR) market has really taken off in the last few years in markets across Europe. As societies have evolved towards a need for flexibility in all aspects of their lives, the appeal of long-term renting in purpose-built homes with added services has increased. Add to this the high cost of buying a home and the sector is forecast for strong growth.&nbsp;<\/p>\n\n\n\n<p>Taking note, institutional investment has flooded into BTR and predictions are that this flow will continue. However, while investment in the sector might be well-placed, asset allocators are missing out on by far the largest element of the residential market that already exists: single-family rental (SFR).<\/p>\n\n\n\n<p>SFR refers to houses or apartments that are rented by one family or individual. Often held by private landlords, this is the largest untapped investment market there is. In Europe, existing single-family stock makes up 98% of the residential market, comprising both rented and owner-occupied housing. The other 2% – comprising multifamily or BTR-type investment – is all that institutional investment capital is currently looking at.<\/p>\n\n\n\n<p>The SFR market has already taken off in the US, where industry leaders such as Invitation Homes and Pretium are amassing vast portfolios – currently at 80,000 and 66,000 homes respectively, according to CBRE. While investors such as these currently only own 2-3% of the US market, that’s far more homes than are owned by institutional investors in Europe.<\/p>\n\n\n\n<p>Europe’s SFR sector is therefore ripe with opportunity. Not only that, but existing SFR holds a swathe of benefits over BTR that we should start to digest:<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Speed and scale<\/h4>\n\n\n\n<p>It can take years to develop and generate returns from a BTR asset. Land must be secured, planning obtained, construction follows, then leasing – it’s a process that can take many years and requires a lot of upfront capital. BTR is also challenging to scale, as each city, district or municipality has different planning laws and priorities.<\/p>\n\n\n\n<p>Our approach to SFR today, in contrast, is speedy. One of the main reasons why institutional investors haven’t tapped into the SFR market in the past is the time it took to create a portfolio of single assets – house or apartments – scattered across Europe. Many countries, such as the UK or Germany, have lengthy, quite archaic buying procedures that have always made acquiring just one asset operationally intensive.<\/p>\n\n\n\n<p>Technology such as that created by IMMO has fundamentally changed the <a href=\"https:\/\/immo.capital\/investment-process\/\" data-type=\"page\" data-id=\"22\">speed and ease at which portfolios can be built<\/a>. We assess thousands of leads each week, using a combination of market intelligence and automated data processing, to identify those that offer both stable long-term yields and uplifts in valuation. The technology infrastructure that is the backbone of our business crunches the numbers – expected purchase price, rental potential, the amount of investment required to bring the property up to standard, as examples – and provides transparent reports for our institutional partners to have complete oversight of their portfolios.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Environmental sustainability<\/h4>\n\n\n\n<p>There is of course a place and need for BTR. Towns and cities across Europe need homes, so new homes must be built. However, the embodied emissions and waste generated by building a new home is colossal. It takes between 50 and 80 tonnes of CO2 to build a new house, according to a study called <a href=\"https:\/\/www.world-habitat.org\/wp-content\/uploads\/2016\/03\/New-Tricks-with-Old-Bricks1.pdf\">New Tricks With Old Bricks<\/a>, compared to 15 tonnes if an existing building were repurposed.&nbsp;<\/p>\n\n\n\n<p>If, instead of constructing BTR properties, more investment was put into improving the vast amount of substandard residential property across Europe, governments would have a much better chance of reaching their targets for net zero carbon. The built environment is responsible for almost 40% of energy and process-related emissions globally, <a href=\"https:\/\/www.savills.com\/impacts\/natural-forces\/real-estates-road-to-net-zero.html\">according to Savills Research<\/a>, and it’s misguided to believe that building highly efficient new homes is anything more than a tiny part of the solution. It can take decades for the energy savings from efficiency to match the carbon generated during construction. Many more solutions are needed, particularly in the residential sector, the largest proportion of real estate.<\/p>\n\n\n\n<p>In short, the greenest building is one that already exists. Single-family provides an ideal opportunity for institutional investors to tackle the 98% of residential property that already exists, upgrading homes for a sustainable future. If the corporate sector is truly committed to net zero, they won’t be able to achieve this by tinkering with 2% of the market.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Benefits for residents<\/h4>\n\n\n\n<p>Upgrading existing SFR doesn’t stop at environmental sustainability. A lot of the assets we buy are substandard, acquired from owner-occupiers or private landlords who haven’t looked after them. Our local teams on the ground are adept at spotting opportunities where a home can be brought up to today’s aspirational living standards, both aesthetically and by providing the level of technology that residents expect from a 21<sup>st<\/sup> century landlord.&nbsp;<\/p>\n\n\n\n<p>Our mantra is ‘quality housing at fair pricing’ and we are proud to create homes that people enjoy living in, often at a rent that is below market level as we can afford to do so. The result is a secure, loyal, happy resident. Our ambition is to enhance existing communities, so people can find the home they’re looking for without having to look further afield for high-quality housing.&nbsp;&nbsp;<\/p>\n\n\n\n<p>In contrast, every aspect of a BTR scheme must be analysed, right down to the value and use of each square metre. In the end, the quality of the resident’s living space and experience might be compromised. And while BTR schemes often offer services and benefits that some people can pay a premium for, in certain markets they are pricing homes out of the reach of many renters.&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Risk mitigation<\/h4>\n\n\n\n<p>The final, clear benefit, of existing SFR is that it offers a secure, diversified investment. There is huge scope to build, very quickly, a sizeable income-generating portfolio that is stabilised. Assets can span cities, even countries, providing diversified risk that can weather any storm.<\/p>\n\n\n\n<p>A BTR scheme may generate higher returns, once it is up and running, but the risk is higher. Having a single, large asset in one location is essentially putting a lot of eggs in one basket – what if a nearby planning permission has a negative effect on residents’ outlook, or a pandemic means that people suddenly want to leave the city centre? It’s also possible to create large rental assets that effectively compete against each other for residents. If demand were to drop, the result could be long periods of vacancy.<\/p>\n\n\n\n<p><a href=\"https:\/\/immo.capital\/investment-process\/\" data-type=\"page\" data-id=\"22\">Managing dispersed residential units<\/a>, particularly through an end-to-end partner such as IMMO, is the lowest risk you can have. We can find properties, create, up-cycle and manage a portfolio quickly and seamlessly, using the power of technology and data available today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The build-to-rent (BTR) market has really taken off in the last few years in markets across Europe. As societies have evolved towards a need for flexibility in all aspects of their lives, the appeal of long-term renting in purpose-built homes with added services has increased. Add to this the high cost of buying a home [&hellip;]<\/p>\n","protected":false},"featured_media":1877,"parent":0,"template":"","tags":[26],"article_category":[27],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"533"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1874"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":5,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1874\/revisions"}],"predecessor-version":[{"id":1965,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1874\/revisions\/1965"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/1877"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=1874"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=1874"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=1874"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}