{"id":2408,"date":"2023-02-09T14:30:00","date_gmt":"2023-02-09T14:30:00","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=2408"},"modified":"2023-02-08T13:59:56","modified_gmt":"2023-02-08T13:59:56","slug":"inflation-is-driving-the-shift-to-residential-investment","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/inflation-is-driving-the-shift-to-residential-investment\/","title":{"rendered":"Inflation is driving the shift to residential investment"},"content":{"rendered":"\n<p>‘What comes up, must come down’. For investors, homeowners and renters in the UK, the question is when and how much this saying might come true.<\/p>\n\n\n\n<p>High inflation means that the purchasing power of money is falling. When the annual rate of inflation &#8216;easing&#8217; means a drop to 9.2% in Europe in December 2022, we can agree that we are in unprecedented times in recent history.&nbsp;<\/p>\n\n\n\n<p>The problem many institutional investors are facing is that capital needs to be allocated at scale to investments with inflation-hedged incomes to avoid the risk of losing value. Money not invested in the right asset classes today will be worth less in the future.<\/p>\n\n\n\n<p>The investors we are working with tell us that a major reason for making the investment decision to focus on European Single-Family Rental homes is because they offer reliable, inflation-hedged income and long term growth.&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Why does residential property make sense in an inflationary environment<\/strong>?<\/h4>\n\n\n\n<p>Residential property is traditionally seen as a ‘safe’ place to store wealth because housing is essential. The need for housing is ongoing and growing, and supply is constrained. The housing market across Europe tends to fall more slowly and by less than its stock market counterparts in response to a crash, as we all need a place to call home, and transactions take time.&nbsp;<\/p>\n\n\n\n<p>Inflation means that costs are rising. This includes the cost to build housing (and therefore the price it can be sold at) and the cost of rent. As a result, in many markets across Europe, both asset values and cash flows available are at all time highs.<\/p>\n\n\n\n<p>Rental income from Single-Family Rental investments is a reliable hedge against inflation. It’s reliable because housing is essential. It’s an inflation hedge because rental income tends to grow in line with or above wage inflation.<\/p>\n\n\n\n<p>In addition, Single-Family Rental housing values are growing long term because demand outstrips constrained supply. Supply is held back because there is a fixed amount of land available, and building new homes takes time. This problem is getting worse as construction materials and labour become more expensive. Meanwhile, our ageing population and shrinking household sizes mean the number of homes we need is growing. There is a shortage in supply for all kinds of homes: to own and for rent.&nbsp;<\/p>\n\n\n\n<p>In some European countries such as the UK, home ownership is more prevalent (64% owner occupied) and popular than in others, like Germany (49.5% owner occupied).&nbsp;<\/p>\n\n\n\n<p>Regardless of this national variation, throughout Europe, there is a shortage of rental housing as house prices have been pushed beyond what is affordable for many households, meaning many who aspired to own a home must rent. House price growth beyond what is affordable means rental demand is increasing further, pushing growth in rental prices. Growth in rental prices ensures that the yield-based valuation of properties continues growing.<\/p>\n\n\n\n<p>To find out more about the Single Family Rental portfolios we’re building in Germany, Spain and the UK, get in touch: <a rel=\"noreferrer noopener\" href=\"mailto:hello@immo.capital\" target=\"_blank\">hello@immo.capital<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>‘What comes up, must come down’. For investors, homeowners and renters in the UK, the question is when and how much this saying might come true. High inflation means that the purchasing power of money is falling. When the annual rate of inflation &#8216;easing&#8217; means a drop to 9.2% in Europe in December 2022, we [&hellip;]<\/p>\n","protected":false},"featured_media":2409,"parent":0,"template":"","tags":[37,38,26],"article_category":[27],"cmb2":{"feature_metabox":{"feature_blog":""},"custom_author_metabox":{"custom_author_id":"532"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2408"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":11,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2408\/revisions"}],"predecessor-version":[{"id":2468,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2408\/revisions\/2468"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/2409"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=2408"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=2408"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=2408"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}