{"id":2496,"date":"2023-02-16T14:30:00","date_gmt":"2023-02-16T14:30:00","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=2496"},"modified":"2023-02-15T12:14:38","modified_gmt":"2023-02-15T12:14:38","slug":"what-higher-interest-rates-mean-for-single-family-rental-investments","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/what-higher-interest-rates-mean-for-single-family-rental-investments\/","title":{"rendered":"What higher interest rates mean for Single Family Rental investments"},"content":{"rendered":"\n<p>Interest rates are being raised by central banks seeking to control inflation. This has two consequences for investors. Firstly, there is an immediate increase in the cost of capital. To achieve the same risk-adjusted returns as before, higher returns or lower risk returns are needed. Secondly, there is the likely longer term economic slowdown that results from more expensive capital. This makes it harder to identify investment strategies offering higher, more stable returns.<\/p>\n\n\n\n<p>Interest rate rises have two key consequences. Firstly, an increase in the cost of mortgages means some borrowers on variable or standard variable rate mortgages (in the UK, for example, this is c. 2m borrowers, representing c. 8% of homes) will face financial pressures as their mortgage interest rates could double or more. Some of these property owners will choose to sell and live in rented homes. This creates a buying opportunity for well-capitalised, smart investors focused on longer term value.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-3\">\n<div class=\"wp-block-column is-layout-flow\">\n<p>Secondly, both building and buying investment properties using finance becomes more expensive. This reduces the supply of existing and new rented&nbsp;homes. Both factors have the same result: more demand and less supply in the rental sector.&nbsp;<\/p>\n\n\n\n<p>The problem for renters is that the shortage of quality, energy efficient, affordable homes for rent in Europe is getting worse.<\/p>\n\n\n\n<p>Meanwhile, investors’ capital needs to generate inflation-resistant cash flow to match investors’ liabilities and to avoid losing out now and in the future in times of rapidly rising costs.<\/p>\n\n\n\n<p>Institutional European Single-Family Rental investments could be the answer to both problems, as they offer stability, reliable, inflation-hedged income and long term growth.<\/p>\n<\/div>\n\n\n\n<div class=\"wp-block-column is-layout-flow\">\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/immo.capital\/wp-content\/uploads\/2023\/02\/iStock-172145563-1640x1093.jpg\" alt=\"\" class=\"wp-image-2500\" width=\"533\" height=\"355\" srcset=\"https:\/\/immo.capital\/wp-content\/uploads\/2023\/02\/iStock-172145563-1640x1093.jpg 1640w, https:\/\/immo.capital\/wp-content\/uploads\/2023\/02\/iStock-172145563-698x465.jpg 698w, https:\/\/immo.capital\/wp-content\/uploads\/2023\/02\/iStock-172145563-327x218.jpg 327w, https:\/\/immo.capital\/wp-content\/uploads\/2023\/02\/iStock-172145563-451x301.jpg 451w\" sizes=\"(max-width: 533px) 100vw, 533px\" \/><\/figure>\n<\/div>\n<\/div>\n\n\n\n<p>In 2017, IMMO was formed with a mission to help meet European renters’ needs, today and in the future. We create Single-Family Rental portfolios at speed and scale, then upgrade each property to provide eco-optimised rental homes where they are needed. Our technology and data enables investors to access stabilised, diversified returns at scale. It gives investors access to the 98% of the residential market that is made up of individual flats and houses, which until now, has not been accessible in Europe. It gives middle-income residents a safe, quality, energy efficient place to call home, within their existing communities.&nbsp;<\/p>\n\n\n\n<p>We are currently allocating £2.5 billion of capital on behalf of institutional investors to income-generating residential portfolios across Germany and Spain, and the United Kingdom. To find out more about how we could help you to access European Single-Family Rental, get in touch: <a href=\"mailto:hello@immo.capital\" target=\"_blank\" rel=\"noreferrer noopener\">hello@immo.capital<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Interest rates are being raised by central banks seeking to control inflation. This has two consequences for investors. Firstly, there is an immediate increase in the cost of capital. To achieve the same risk-adjusted returns as before, higher returns or lower risk returns are needed. Secondly, there is the likely longer term economic slowdown that [&hellip;]<\/p>\n","protected":false},"featured_media":2497,"parent":0,"template":"","tags":[39,32,26],"article_category":[27],"cmb2":{"feature_metabox":{"feature_blog":""},"custom_author_metabox":{"custom_author_id":"532"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2496"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":13,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2496\/revisions"}],"predecessor-version":[{"id":2537,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2496\/revisions\/2537"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/2497"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=2496"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=2496"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=2496"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}