{"id":47,"date":"2020-07-16T09:41:43","date_gmt":"2020-07-16T09:41:43","guid":{"rendered":"http:\/\/immo.capital\/?page_id=47"},"modified":"2022-01-19T14:08:49","modified_gmt":"2022-01-19T14:08:49","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/immo.capital\/terms-and-conditions\/","title":{"rendered":"Terms and conditions"},"content":{"rendered":"\n<section class=\"wp-block-immocapital-container\"><block class=\"block-container\" style=\"background-color:#FFFFFF;color:#000000;padding-top:calc(60px*var(--scale));padding-bottom:calc(120px*var(--scale))\"><div class=\"container\">\n<p class=\"has-h-3-font-size\">Terms and conditions<\/p>\n\n\n\n<p><em>The investments described on this website are not suitable for retail clients.<\/em><\/p>\n\n\n\n<p><strong>Information on this Site<\/strong><\/p>\n\n\n\n<p>The information on this website (&#8220;<strong>Information<\/strong>&#8220;) is issued by IMMO Investment Technologies Limited (&#8220;<strong>IMMO<\/strong>&#8220;), a company incorporated in England and Wales under number 10910489, with its registered office at 2h Woodstock Studios, 36 Woodstock Grove, London, England, W12 8LE.<\/p>\n\n\n\n<p>The Information is not directed at any person in any jurisdiction where it is illegal or unlawful to distribute, access and use such information or where such distribution, access or use would subject IMMO to any registration requirements within such jurisdiction. IMMO disclaims all responsibility if you access or download any Information in breach of any law or regulation of the country in which you reside.<\/p>\n\n\n\n<p>The Information is not directed at any person in the United States and this site is not intended to be used by any person in the United States unless those persons have applicable US exemptions.<\/p>\n\n\n\n<p>Accordingly, all persons who access this site are required to inform themselves of and to comply with all applicable sales restrictions in their home country.<\/p>\n\n\n\n<p><strong>No Liability<\/strong><\/p>\n\n\n\n<p>Whilst all reasonable steps have been taken to ensure the accuracy and completeness of the Information, no representation, warranty or undertaking is given as to the accuracy or completeness of the Information by IMMO or any of its associated companies and no liability is accepted by such persons for the accuracy or completeness of such Information. In no event will IMMO or any of its associated companies be liable to any person for any direct, indirect, special or consequential damages arising out of any use of the Information, or on any other hyper-linked site, including, without limitation, any lost profits, business interruption, loss of programmes or data on your equipment, or otherwise, even if IMMO is expressly advised of the possibility or likelihood of such damages.<\/p>\n\n\n\n<p>You should be aware that the Internet is not a completely reliable transmission medium and access to and use of this website is at your own risk. IMMO does not accept any liability for any data transmission errors such as data loss or damage or alteration of any kind, including, but not limited to any direct, indirect or consequential damage, arising out of the use of the products or services referred to herein. Furthermore, we accept no liability in respect of losses or damages arising out of changes made to the content of the website by unauthorised third parties.<\/p>\n\n\n\n<p><strong>Indemnity<\/strong><\/p>\n\n\n\n<p>You agree to indemnify, defend, and hold harmless IMMO, its affiliates and licensors, and the directors, officers, employees, and agents of IMMO and its affiliates and licensors, from and against any and all claims, liabilities, damages, losses, or expenses, including legal fees and costs, arising out of or in any way connected with your access to or use of this website and the Information.<\/p>\n\n\n\n<p><strong>Risk Factors<\/strong><\/p>\n\n\n\n<p>The value of investments may go down as well as up, and investors may not get back all or any amount originally invested. Income or other returns from investments are subject to change and may be lower than estimated. Past performance is not a reliable indicator of future performance.<\/p>\n\n\n\n<p>IMMO manages strategies which invest in real property and which may be subject to higher risk and volatility than other strategies and may not be suitable for all investors. Further, the strategies may be leveraged thereby increasing the risk of loss.<\/p>\n\n\n\n<p>The levels and bases of and reliefs from taxation may change. Any tax reliefs referred to are those currently available and their value depends on the circumstances of the individual investor. Investors should consult their own tax adviser in order to understand any applicable tax consequences.<\/p>\n\n\n\n<p><strong>Copyright, Trademarks and Other Rights<\/strong><\/p>\n\n\n\n<p>Copyright, trademarks, database rights, patents and all similar rights in this site and the information contained in it are owned by IMMO, its licensors or relevant third-party providers. You may use the Information and reproduce it in hard copy for your personal reference only. The Information may not otherwise be reproduced, distributed, stored or transmitted without IMMO&#8217;s written consent. Nothing on this site should be considered as granting any licence or right under any trademark of IMMO or any third party.<\/p>\n\n\n\n<p><strong>Accuracy of Information<\/strong><\/p>\n\n\n\n<p>The Information (including any expression of opinion or forecast) has been obtained from, or is based on, sources believed by IMMO to be reliable, but is not guaranteed as to its accuracy or completeness and should not be relied upon. The Information is provided without obligation on the part of IMMO and on the understanding that any person who acts upon it or changes his investment position in reliance on it does so entirely at his own risk. The Information does not constitute an offer to buy or sell or an invitation to make an offer to buy or sell shares, units or interests in any investment fund referred to herein.<\/p>\n\n\n\n<p>Information is current only as at the date it is first posted and may no longer be true or complete when viewed by you. All Information may be changed or amended without prior notice although IMMO does not undertake to update this site regularly. IMMO Capital shall not be obliged to remove any outdated information from the website or to expressly mark it as being outdated.<\/p>\n\n\n\n<p><strong>No Advice<\/strong><\/p>\n\n\n\n<p>The Information is provided for information purposes only and on the basis that you make your own investment decisions and do not rely upon it. IMMO is not soliciting any action based on it and it does not constitute a personal recommendation or investment advice. Should you have any queries about the investment strategies referred to on this site, you should contact your financial adviser.<\/p>\n\n\n\n<p><strong>Internet Email<\/strong><\/p>\n\n\n\n<p>Messages sent over the Internet cannot be guaranteed to be completely secure. They could be intercepted, lost or possibly altered. IMMO cannot and will not take responsibility for this, and will not be liable to you or anyone else for any damages or otherwise, in connection with any message sent, either by you to IMMO, or by IMMO to you, over the Internet.<\/p>\n\n\n\n<p><strong>Material Interests<\/strong><\/p>\n\n\n\n<p>IMMO and its directors, officers and\/or employees may have holdings in the portfolios referred to on this site and may otherwise be interested in transactions that you effect in those portfolios.<\/p>\n\n\n\n<p><strong>Linked Websites<\/strong><\/p>\n\n\n\n<p>This site may be linked to third party websites or contain information provided by third parties. These links are provided only as a convenience. IMMO does not make any representation as to the accuracy or completeness of such websites or information, has not and will not review or update such websites or information. You acknowledge and agree that, as you have chosen to enter the linked website, use made of such websites or information is at your own risk. IMMO does not accept any liability arising out of the information contained on any linked website or information provided by a third party and the use of such sites and information is at your own risk. You should also be aware that the terms and conditions of such website and the website&#8217;s statement relating to the collection and use of your personal information may be different from those applicable to your use of this website<\/p>\n\n\n\n<p><strong>Governing Law<\/strong><\/p>\n\n\n\n<p>You agree that your use of this site and any dispute arising from the use of this site is subject to English law and you submit to the jurisdiction of the English courts.<\/p>\n<\/div><\/block><\/section>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"content-type":""},"cmb2":{"all_pages_metabox":{"page_header_color_class":"header-white-black","page_footer_cta":"cta2"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/pages\/47"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/comments?post=47"}],"version-history":[{"count":7,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/pages\/47\/revisions"}],"predecessor-version":[{"id":2733,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/pages\/47\/revisions\/2733"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=47"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}