{"id":3,"date":"2020-07-13T08:50:13","date_gmt":"2020-07-13T08:50:13","guid":{"rendered":"http:\/\/immo.capital\/?page_id=3"},"modified":"2022-01-19T15:54:48","modified_gmt":"2022-01-19T15:54:48","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/immo.capital\/privacy-policy\/","title":{"rendered":"Privacy policy"},"content":{"rendered":"\n<section class=\"wp-block-immocapital-container\"><block class=\"block-container\" style=\"background-color:#FFFFFF;color:#000000;padding-top:calc(60px*var(--scale));padding-bottom:calc(120px*var(--scale))\"><div class=\"container\">\n<h1 class=\"wp-block-heading\">Privacy policy<\/h1>\n\n\n\n<p>This policy is issued by IMMO and summarises how IMMO use, share and store the data collected from you when you visit IMMO&#8217;s website, when you become an investor in a product managed by IMMO, when you become a tenant in a property owned by a product managed by IMMO or when you apply for a job with IMMO. This privacy policy applies to IMMO&#8217;s site and all products and services offered by IMMO and by entering our site you are agreeing to the policies described herein.<\/p>\n\n\n\n<p>IMMO is committed to safeguarding the personal information which you may provide to us and to the extent that IMMO collects any personal information, IMMO will hold it in confidence in accordance with the Data Protection Act 1998 and the General Data Protection Regulation (GDPR) (EU) 2016\/679 which came into force on 25 May 2018.<\/p>\n\n\n\n<p><strong>Information you share with us<\/strong><\/p>\n\n\n\n<p>You may be asked to voluntarily provide certain personal information details about you such as your name, address, telephone number, email address and other information in connection with IMMO&#8217;s customer or tenant registration procedures and job application process. IMMO will use this information for the administration and servicing of your investments, performing its obligations under lease contracts, evaluating job applications and other related activities and to ensure compliance with its obligations under the UK regulatory regime. IMMO may disclose the information to its agents and service providers.<\/p>\n\n\n\n<p>Please note that by submitting personal information you are consenting to such information being processed for the purposes referred to above. You agree that IMMO has the right to use and store such data on its internal systems and to transfer it to its associated companies and third- party agents and service providers where applicable, whether inside or outside the United Kingdom or the European Union to countries having an adequate level of data protection.<\/p>\n\n\n\n<p><strong>Information we collect from you <\/strong><\/p>\n\n\n\n<p>The IMMO site collects both behavioural data (information about how you use our site); and technical data (information about the device you use to access our site). IMMO uses the Google Analytics service provided by Google Inc. (“Google”) to collect this data.<\/p>\n\n\n\n<p>Examples of behavioural data collected:<\/p>\n\n\n\n<ul><li>Terms entered via our search facility<\/li><li>Pages visited<\/li><li>Length of time spent on each page<\/li><li>The referring site from which you visited<\/li><\/ul>\n\n\n\n<p>Examples of technical data collected:<\/p>\n\n\n\n<ul><li>Your web browser type and version<\/li><li>Your device type and operating system<\/li><\/ul>\n\n\n\n<p>The site does not collect any data that makes you personally identifiable. The information obtained via Google Analytics is anonymised and cannot be attributed to any one individual. Google Analytics is set to retain data for a duration of 38 months.<\/p>\n\n\n\n<p>Google provides a method to opt out of their Google Analytics service completely. Opting out will prevent Google Analytics from collecting your data from any site that uses their service.<\/p>\n\n\n\n<p><strong>Why we Collect this Information<\/strong><\/p>\n\n\n\n<p>This information provides us with a better understanding of how our site is being used. This understanding informs any improvements we undertake and ensures that the site and its content continue to best serve the needs of our visitors.<\/p>\n\n\n\n<p><strong>How we keep data safe<\/strong><\/p>\n\n\n\n<p>IMMO adheres to the following practices to help keep the data that we process safe:<\/p>\n\n\n\n<ul><li>We encrypt and protect the transmission of information using Secure Sockets Layer (SSL).<\/li><li>We host our site and its contents with Amazon Web Services (AWS) on a secure server within the European Economic Area (EEA).<\/li><li>We limit server access by Internet Protocol (IP) address to only those that require it.<\/li><li>We have a server firewall in place that permits only standard inbound internet traffic – HTTP, HTTPS &amp; SSH (restricted by IP).<\/li><li>We control and regulate access to our IMMO data files and email accounts.<\/li><li>We enforce strong passwords and 2 factor authentication (2FA) wherever possible.<\/li><\/ul>\n\n\n\n<p><strong>Cookies<\/strong><\/p>\n\n\n\n<p>We use cookies and similar technologies to offer you a better browsing experience, analyse site traffic and personalise content. Continuing to use our site will imply that you consent to our use of cookies. Please refer to our cookie policy for further information.<\/p>\n\n\n\n<p>Provision of Information to Third Parties<\/p>\n\n\n\n<p>A Data Processor is a third party with which we are required to share personal detail in the provision of investment and property management services. IMMO will only share personal information in the following circumstances:<\/p>\n\n\n\n<ul><li>where the transfer is necessary to fulfil the requirements of the contract or operation for which the information was provided, and the third party is a Data Processor;<\/li><li>as required by a court order or any other legal or regulatory requirement.<\/li><\/ul>\n\n\n\n<p>IMMO does not collect or compile personal data or information obtained through the Website for dissemination or sale to outside parties.<\/p>\n\n\n\n<p>We may share your personal information with third party organisations:<\/p>\n\n\n\n<ul><li>Professional firms, agents and advisers who we use to help run your accounts and services, collect what you owe, administer funds, manage properties and explore new ways of doing business;<\/li><li>HM Revenue &amp; Customs, regulators and other authorities;<\/li><li>Third parties as required through IMMO’s or its affiliates’ regulatory requirements arising from the provision of investment or property management services;<\/li><li>Fraud prevention agencies;<\/li><li>Companies we have a joint venture or agreement to co-operate with;<\/li><li>Companies within the IMMO group;<\/li><li>Organisations that introduce you to us;<\/li><li>Independent Financial Advisors, or other regulated entities or parties involved in the management of your relationship with IMMO; or<\/li><li>Companies you ask us to share your data with.<\/li><\/ul>\n\n\n\n<p>We require all third parties with whom we share your personal information to respect the security of your data and to treat it in accordance with the law. We do not allow such third parties to use your personal data for their own purposes. We only permit them to process your personal data for specified purposes and in accordance with our instructions.<\/p>\n\n\n\n<p><strong>Your Rights and Your Personal Data<\/strong><\/p>\n\n\n\n<p>Unless subject to an exemption under the GDPR, you have the following rights with respect to your personal data:<\/p>\n\n\n\n<ul><li>The right to request a copy of your personal data which IMMO holds about you;<\/li><li>The right to request that IMMO corrects any personal data if it is found to be inaccurate or out of date;<\/li><li>The right to request your personal data is erased where it is no longer necessary for IMMO to retain such data;<\/li><li>The right to withdraw your consent to the processing at any time;<\/li><li>The right to request that IMMO provide the data subject with his\/her personal data and where possible, to transmit that data directly to another data controller, (known as the right to data portability);<\/li><li>The right, where there is a dispute in relation to the accuracy or processing of your personal data, to request a restriction is placed on further processing;<\/li><li>The right to object to the processing of personal data;<\/li><li>The right to lodge a complaint with the Information Commissioners Office.<\/li><\/ul>\n\n\n\n<p><strong>How long we keep your Data<\/strong><\/p>\n\n\n\n<p>We are required to retain certain client related information for <a>up to 7 years<\/a><a href=\"#_msocom_1\">[up1]<\/a>&nbsp;, after which time it will be destroyed. Personal information that we use for marketing purposes will be kept with us until you notify us that you no longer wish to receive this information. After you stop being a client, we may keep your data for up to 7 years for one of these reasons:<\/p>\n\n\n\n<ul><li>To respond to any questions or complaints;<\/li><li>To show that we treated you fairly; or<\/li><li>To maintain records according to rules that apply to us.<\/li><\/ul>\n\n\n\n<p>CVs in respect of unsuccessful applicants are deleted promptly following completion of the job application process.<\/p>\n\n\n\n<p><strong>Marketing<\/strong><\/p>\n\n\n\n<p>We may use your personal information to tell you about relevant products and offers. This is what we mean when we talk about ‘marketing’.<\/p>\n\n\n\n<p>The personal information we have for you is made up of what you tell us, and data we collect when you use our services, or from third parties we work with.<\/p>\n\n\n\n<p>We study this to form a view on what we think you may want or need, or what may be of interest to you. This is how we decide which products, services and offers may be relevant for you. We can only use your personal information to send you marketing messages if we have either your consent or a ‘legitimate interest’. That is when we have a business or commercial reason to use your information. It must not unfairly go against what is right and best for you. You can ask us to stop sending you marketing messages by contacting us at any time. If at any point you believe the information we process on you is incorrect you can request to see this information and have it corrected or deleted. If you wish to raise a complaint on how we have handled your personal data, you can contact us on the details below to have the matter investigated.<\/p>\n\n\n\n<p><strong>Hotjar<\/strong><\/p>\n\n\n\n<p>We use <a href=\"https:\/\/www.hotjar.com\/\">Hotjar<\/a> in order to better understand our users’ needs and to optimize this service and experience. Hotjar is a technology service that helps us better understand our users experience (e.g. how much time they spend on which pages, which links they choose to click, what users do and don’t like, etc.) and this enables us to build and maintain our service with user feedback. Hotjar uses cookies and other technologies to collect data on our users’ behavior and their devices (in particular device&#8217;s IP address (captured and stored only in anonymized form), device screen size, device type (unique device identifiers), browser information, geographic location (country only), preferred language used to display our website). Hotjar stores this information in a pseudonymized user profile. Neither Hotjar nor we will ever use this information to identify individual users or to match it with further data on an individual user. For further details, please see Hotjar’s privacy policy by clicking on <a href=\"https:\/\/www.hotjar.com\/legal\/policies\/privacy\">this link<\/a>.<\/p>\n\n\n\n<p>You can opt-out to the creation of a user profile, Hotjar’s storing of data about your usage of our site and Hotjar’s use of tracking cookies on other websites by following this <a href=\"https:\/\/www.hotjar.com\/legal\/compliance\/opt-out\">opt-out link<\/a>.<\/p>\n\n\n\n<p><strong>Privacy policy changes<\/strong><\/p>\n\n\n\n<p>We may update this privacy policy from time to time in order to reflect, for example, changes to our practices or for other operational, legal or regulatory reasons. For clarity, we shall include the date of the most recent revision at the bottom of the page. The amended privacy policy shall be effective as from that date. We therefore recommend that you refer back to this periodically.<\/p>\n\n\n\n<p><strong>Your rights<\/strong><\/p>\n\n\n\n<p>If you are a European resident, you have the right to access personal information we hold about you and to ask that your personal information be corrected, updated, or deleted. If you would like to exercise this right, please contact us through the contact information below.<\/p>\n\n\n\n<p><strong>Data processor <\/strong><\/p>\n\n\n\n<p>For the purpose of the Data Protection Act (1998) and the General Data Protection Regulations (GDPR) (EU) 2016\/679 the Data Controller is IMMO Investment Technologies UK Limited.<\/p>\n\n\n\n<p><strong>Contact us<\/strong><\/p>\n\n\n\n<p>IMMO is not required to appoint a Data Protection Officer. [up4] For more information about our privacy policies or if you have any questions, we welcome your comments. Please contact us at <a href=\"mailto:hello@immo.capital\">hello@immo.capital<\/a> or by mail:<\/p>\n\n\n\n<p><br>IMMO Investment Technologies UK Limited<br>36 Woodstock Grove<br>2H Woodstock Studios<br>London<br>W12 8LE<\/p>\n\n\n\n<p>Last updated: 17 September 2020<\/p>\n\n\n\n<p><strong><u>Cookie policy<\/u><\/strong><\/p>\n\n\n\n<p>IMMO use cookies and other similar technologies to improve your experience of our site. This policy refers to cookies used by sites utilising the [immo.capital] domain name.<\/p>\n\n\n\n<p>What are cookies?<\/p>\n\n\n\n<p>Cookies are text files containing small amounts of information which are downloaded to your device when you visit our site. Cookies are sent back from your browser to our site on each subsequent visit, or to another site that recognises that cookie. Cookies allow us to recognise and distinguish between the different users and devices that visit our site.<\/p>\n\n\n\n<p>Cookies perform many different tasks, such as letting you navigate between pages efficiently, remembering your preferences or improving the browsing experience.<\/p>\n\n\n\n<p>For more information about cookies please visit:<\/p>\n\n\n\n<ul><li><a href=\"https:\/\/www.aboutcookies.org\/\">www.aboutcookies.org<\/a><\/li><li><a href=\"http:\/\/www.allaboutcookies.org\/\">www.allaboutcookies.org<\/a><\/li><li><a href=\"http:\/\/www.youronlinechoices.eu\/\">www.youronlinechoices.eu<\/a><\/li><li><a href=\"http:\/\/www.international-chamber.co.uk\/our-expertise\/digitaleconomy\">www.international-chamber.co.uk\/our-expertise\/digitaleconomy<\/a><\/li><\/ul>\n\n\n\n<p>Types of cookies used<\/p>\n\n\n\n<p>We use the following cookies on our site:<\/p>\n\n\n\n<p><strong>Analytics cookies<\/strong><strong><\/strong><\/p>\n\n\n\n<p>Analytics cookies collect information about how visitors use our site, for instance which pages they access most often or the frequency of their visits. This information provides us with a better understanding of how our site is being used.<\/p>\n\n\n\n<p>Our site uses the Google Analytics service provided by Google Inc. (“Google”). The information obtained via Google Analytics is anonymised and cannot be attributed to any one individual. Google provides further information on<a href=\"https:\/\/developers.google.com\/analytics\/devguides\/collection\/analyticsjs\/cookie-usage\">how Google Analytics uses cookies<\/a>and also provides a method to<a href=\"https:\/\/tools.google.com\/dlpage\/gaoptout\">opt out of Google Analytics<\/a>completely.<\/p>\n\n\n\n<p><strong>Functionality cookies<\/strong><strong><\/strong><\/p>\n\n\n\n<p>Functionality cookies allow us to remember your saved preferences and therefore provide enhanced, more personal features. The information these cookies collect is anonymised and cannot track your browsing activity on other sites.<\/p>\n\n\n\n<p><strong>First party cookies<\/strong><strong><\/strong><\/p>\n\n\n\n<p>First party cookies are set by our [immocapital.co.uk] domain rather than the domain of a third party. This allows us to closely control the data they collect.<\/p>\n\n\n\n<p><strong>Third party cookies<\/strong><strong><\/strong><\/p>\n\n\n\n<p>Third party cookies are set by a domain other than [immocapital.co.uk]. For example, we use Google Maps to display the location of our office on our contact page. On visiting the page Google sets a third party cookie on your device so that it can determine if you are an authenticated Google account holder. If so, Google will customise the map accordingly.<\/p>\n\n\n\n<p><strong>Persistent cookies<\/strong><strong><\/strong><\/p>\n\n\n\n<p>Persistent cookies are those which remain on your computer or device for a predetermined duration and are activated each time you visit our site.<\/p>\n\n\n\n<p>Privacy<\/p>\n\n\n\n<p>We have carefully chosen the cookies used on our site and have taken steps to ensure that your privacy and personal data is protected and respected at all times.<\/p>\n\n\n\n<p>We may include links on our site to external sites (through our News articles for example). Please note that we cannot be responsible or liable for how these sites use cookies and process your personal data. We would recommend looking at the privacy &amp; cookie policies of these sites for further information.<\/p>\n\n\n\n<p>For more details of the personal data that we collect and use, the measures we have in place to protect personal data, your legal rights, and our legal obligations, please refer to our <a href=\"https:\/\/www.mayfaircapital.co.uk\/privacy-policy\">privacy policy<\/a>.<\/p>\n\n\n\n<p>How can I change my cookie settings?<\/p>\n\n\n\n<p>Most internet browsers are set to allow cookies by default though it is possible to change this setting and also remove any unwanted cookies via your browser preferences. Please note that some elements of our site may not work as expected should you disable cookies prior to visiting or remove any existing cookies once set.<\/p>\n\n\n\n<p>The links below provide instructions on how to control Cookies in all the major browsers:<\/p>\n\n\n\n<ul><li><a href=\"https:\/\/support.google.com\/chrome\/answer\/95647\">Google Chrome<\/a><\/li><li><a href=\"https:\/\/support.microsoft.com\/en-us\/help\/278835\/how-to-delete-cookie-files-in-internet-explorer\">Microsoft Internet Explorer<\/a><\/li><li><a href=\"https:\/\/support.microsoft.com\/en-us\/help\/278835\/how-to-delete-cookie-files-in-internet-explorer\">Microsoft Edge<\/a><\/li><li><a href=\"https:\/\/support.apple.com\/kb\/PH21411\">Safari (macOS)<\/a><\/li><li><a href=\"https:\/\/support.apple.com\/en-gb\/HT201265\">Safari (iOS)<\/a><\/li><li><a href=\"https:\/\/support.mozilla.org\/en-US\/kb\/enable-and-disable-Cookies-website-preferences\">Mozilla Firefox<\/a><\/li><li><a href=\"https:\/\/support.google.com\/chrome\/answer\/95647?co=GENIE.Platform%3DAndroid&amp;oco=1\">Android<\/a><\/li><\/ul>\n\n\n\n<p>Please refer to your device’s documentation for manufacturers’ own browsers.<\/p>\n\n\n\n<p>Changes to this cookie policy<\/p>\n\n\n\n<p>We may amend this Cookie Policy at any time. Any changes to this policy will apply on your first visit to our site after the change has been made. You are therefore advised to check this page periodically. In the event of any conflict between the current version of this policy and any previous version – the current version has precedence unless it is expressly stated otherwise.<\/p>\n\n\n\n<p>Further information<\/p>\n\n\n\n<p>If you would like to know more about how we use cookies, we welcome your comments and questions. Please contact us at <a href=\"mailto:hello@immo.capital\">hello@immo.capital<\/a>.<\/p>\n\n\n\n<p>Last updated: 17 September 2020<\/p>\n<\/div><\/block><\/section>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"content-type":""},"cmb2":{"all_pages_metabox":{"page_header_color_class":"header-white-black","page_footer_cta":"cta2"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/pages\/3"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/comments?post=3"}],"version-history":[{"count":7,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/pages\/3\/revisions"}],"predecessor-version":[{"id":1970,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/pages\/3\/revisions\/1970"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=3"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}