{"id":1500,"date":"2020-09-16T03:08:03","date_gmt":"2020-09-16T03:08:03","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=1500"},"modified":"2022-01-19T15:30:40","modified_gmt":"2022-01-19T15:30:40","slug":"announcing-immos-additional-funding-round-bringing-the-total-series-a-to-e14m","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/announcing-immos-additional-funding-round-bringing-the-total-series-a-to-e14m\/","title":{"rendered":"Announcing IMMO’s additional funding round bringing the total Series A to €14M"},"content":{"rendered":"\n<p>We are pleased to announce an additional €3M capital raise from <a href=\"https:\/\/www.fintech.io\/\">FinTech Collective<\/a> &amp; <a href=\"https:\/\/surplusinvest.vc\/\">Surplus Invest<\/a> bringing our total Series A to €14M. The round saw participation from prominent investors like <a href=\"https:\/\/www.taliscapital.com\/\">Talis Capital<\/a> and <a href=\"https:\/\/www.hvventures.com\/\">HV Holtzbrinck Ventures<\/a>. We are also fortunate to count Tom Stafford &amp; Rahul Mehta of DST Global and Mato Perić among our early investors. On top, we have raised over €60 million in real estate capital for deployment through our residential real estate platform.&nbsp;<\/p>\n\n\n\n<p>We founded IMMO in 2017 to reshape the way institutional investors deploy capital into the residential real estate sector. At IMMO, we buy residential properties directly from consumers on behalf of professional investors, thereby providing investors with desired real estate exposure at scale. IMMO homes are fully renovated and often furnished, meaning tenants enjoy quality, long term rental homes that are professionally managed.<\/p>\n\n\n\n<p>Through the COVID crisis, we have been investing heavily in new technologies and innovations that help to simplify real estate transactions. From virtual 360 viewings, online credit checks, and digital contracts for renters that are relocating thousands of miles, all the way to data-driven investing with confidence in unknown cities at the touch of a button, we are turning the traditional real estate sector on its head.&nbsp;<\/p>\n\n\n\n<p>In the past year, IMMO has assessed over 10,000 property leads (€3.5Bn) using proprietary machine learning technology, reducing the underwriting process from days to a matter of minutes. Our inspection team collects close to 300  data-points for every property. The IMMO Intelligence combines this property level data with millions of environmental data-point such as traffic nodes, crime statistics, school\/restaurant\/Airbnb ratings, distance to supermarkets, etc. to come up with an offer price for the seller. It is this speed and accuracy that allows IMMO to buy properties at scale directly from sellers.<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p><em>The additional funding comes at an exciting time as we accelerate our investment platform to offer up more markets across Europe, and develop the full technology suite from acquisitions to asset management. The appetite for residential real estate has only been growing among institutional investors, many of whom are looking at the COVID crisis as an opportunity to focus on safe haven, yield generating asset classes.<\/em>&nbsp;<\/p><\/blockquote><\/figure>\n\n\n\n<p>Professional investors love residential real estate due to its attractive risk-adjusted returns profile. However, deploying capital at scale is very challenging despite the fact that residential is the largest asset class in the world (€39trillion in Europe alone). Single units account for 94% of all residential real estate transactions, but as valuing and acquiring thousands of single units has so far been practically impossible, investors were restricted to deploying in the very limited market of portfolios and multi-family developments. <\/p>\n\n\n\n<p>At IMMO, we have built the technology to source, appraise, and acquire single units at scale, thereby opening up single-unit residential real estate as a new asset class for institutional investors. Over €60 million in capital has already been raised from real estate investors to deploy through our residential real estate platform.<\/p>\n\n\n\n<p>This investment further strengthens our belief in the problem we are solving and allows us to continue, heads down, running hard to fully realize our vision. I take this opportunity to thank all our customers, partners, and investors who have been supporting us every step of the way. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>We are pleased to announce an additional €3M capital raise from FinTech Collective &#038; Surplus Invest bringing our total Series A to €14M. The round saw participation from prominent investors like Talis Capital and HV Holtzbrinck Ventures. We are also fortunate to count Tom Stafford &#038; Rahul Mehta of DST Global and Mato Peric among our early investors. On top, we have raised over €60 million in real estate capital for deployment through our residential real estate platform. <\/p>\n","protected":false},"featured_media":586,"parent":0,"template":"","tags":[20,19],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":""},"custom_author_metabox":{"custom_author_id":"1441"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1500"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":1,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1500\/revisions"}],"predecessor-version":[{"id":1955,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1500\/revisions\/1955"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/586"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=1500"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=1500"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=1500"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}