{"id":1746,"date":"2021-10-27T08:29:51","date_gmt":"2021-10-27T08:29:51","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=1746"},"modified":"2022-01-19T15:35:51","modified_gmt":"2022-01-19T15:35:51","slug":"leading-global-investor-todd-ruppert-joins-immo-capital-as-strategic-advisor","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/leading-global-investor-todd-ruppert-joins-immo-capital-as-strategic-advisor\/","title":{"rendered":"Leading global investor Todd Ruppert joins IMMO as Strategic Advisor"},"content":{"rendered":"\n<p><strong>October 2021<\/strong> – IMMO, the tech-enabled end-to-end platform for Single Family Residential (SFR) investment management, announces that leading global investor Todd Ruppert has joined the business as strategic advisor and investor. <\/p>\n\n\n\n<p>Todd joins IMMO as the company leads in the unlocking of the $42 trillion SFR market in Europe, with almost $2 billion in committed capital to deploy on behalf of some of the largest global investment managers. <\/p>\n\n\n\n<p>Over the last four years, IMMO has built a powerful tech-led platform that utilises AI and machine learning technology to source, underwrite and structure SFR assets into large portfolios for investors, resulting in stabilised rental income, capital appreciation and best-in-class property management. <\/p>\n\n\n\n<p>Todd is the founder and CEO of Ruppert International, a firm with diversified interests globally in various fields including education, financial services, disruptive technologies, publishing, and strategy consulting.&nbsp;<\/p>\n\n\n\n<p>He has 40 years of experience in the financial services industry having retired from T. Rowe Price, the global asset management firm with $1.6 trillion under management, where he was president and CEO of T. Rowe Price Global Investment Services and co-president of T. Rowe Price International, and Greenspring Associates, a $14 billion venture capital firm, where he was a venture partner.<\/p>\n\n\n\n<p>With an entrepreneurial approach to business and extensive cross-sector expertise, Todd sits on numerous boards around the globe. He is also an advisor to a number of venture capital and private equity firms including Antler, Fin VC, Motive Partners, Launch Africa, Access Holdings and BroadLight Capital.<\/p>\n\n\n\n<p><strong>Hans-Christian Zappel, CEO and co-founder of IMMO, said:<\/strong> &#8220;Todd is an excellent addition to the team, as we build out our pan-European platform and carve out a brand-new investment offering within real estate. He comes with extensive investment expertise from the US, where SFR is already a well-established asset class. In Todd, and Professor Andrew Baum, who also recently joined us as a strategic advisor and investor, we are backed by world-renowned industry leaders, demonstrating the strength of IMMO Capital’s proposition.”<\/p>\n\n\n\n<p><\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“I am driven to work with innovative thinkers, in exciting companies solving the world’s biggest challenges across major industries. In venture investing, I look for category-defining companies that use technology to unlock sectors for investment. IMMO ticks all of these boxes. The growth trajectory for SFR in Europe is incredible and IMMO is well equipped to take the lead on this opportunity.”<\/p><cite>Todd Ruppert, Strategic Advisor for IMMO Capital<\/cite><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>October 2021 – IMMO, the tech-enabled end-to-end platform for Single Family Residential (SFR) investment management, announces that leading global investor Todd Ruppert has joined the business as strategic advisor and investor.  Todd joins IMMO as the company leads in the unlocking of the $42 trillion SFR market in Europe, with almost $2 billion in committed [&hellip;]<\/p>\n","protected":false},"featured_media":1748,"parent":0,"template":"","tags":[19],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"1441"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1746"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":2,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1746\/revisions"}],"predecessor-version":[{"id":1961,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1746\/revisions\/1961"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/1748"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=1746"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=1746"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=1746"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}