{"id":1764,"date":"2021-11-19T09:23:02","date_gmt":"2021-11-19T09:23:02","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=1764"},"modified":"2022-01-19T15:37:33","modified_gmt":"2022-01-19T15:37:33","slug":"immo-capital-bolsters-international-team-in-preparation-for-european-expansion","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/immo-capital-bolsters-international-team-in-preparation-for-european-expansion\/","title":{"rendered":"IMMO bolsters international team in preparation for European expansion"},"content":{"rendered":"\n<p><strong>November 2021<\/strong> – <strong>London<\/strong> – IMMO, the tech-enabled end-to-end platform for Single-Family Rental (SFR) investment management, has poached eight new hires across the proptech ecosystem as the company prepares to imminently expand across pan-European countries for the year ahead. The new hires take the overall headcount to 91, up from 45 at the beginning of the year, demonstrating strong growth trajectory.<\/p>\n\n\n\n<p>Heralding investment, real estate, and technology experience across the fintech and residential consumer industries, this latest raft of new hires includes:<\/p>\n\n\n\n<ul><li><strong>Christina Steinmueller<\/strong>, Senior Director of Finance, leadingPortfolio Management, at IMMO<strong>;<\/strong> former VP Distribution at Greensill Capital and directing ~$350M daily asset allocation to 40+ distribution channels.<br><br><\/li><li><strong>Dawid Baranowski, <\/strong>Head of Lettings &amp; Consumer Revenue at IMMO; former Head of Operations at Kiko Homes and Co-founder of Renting Milan.<br><br><\/li><li><strong>Konstantin Andrejev, <\/strong>Head of Investor Platform at IMMO; former Head of Investment at leading B2B digital platform, Brickvest, sourcing and securing commercial real estate debt finance. of £5M+.<br><br><\/li><li><strong>Julian Derber<\/strong>, Head of Data Science &amp; BI at IMMO; former Head of Data &amp; BI at Bauer Media Group and BI lead at LIDL Group GmbH.<br><br><\/li><li><strong>Bhanu Ghantasala, <\/strong>Senior Director of Product Management at IMMO; former Chief Product and Technology Officer at Invisible Homes; Founder of Green Hats Innovation Labs – a digital health start-up backed by European Commission and UKRI, London Business School MBA and comes with 15 years of product &amp; technology leadership experience.<br><\/li><\/ul>\n\n\n\n<p>Additionally,<strong> <\/strong>to strengthen both their business and asset management capabilities<strong>, Tyson Teubner,<\/strong> former Asset Manager at Citidwell, joins as<strong> <\/strong>Director of Asset Management; <strong>Ole Jürs, <\/strong>former Head of Property Management at<strong> HWS Immobilien- und Vermögensverwaltung GmbH <\/strong>joins as<strong> <\/strong>Head of Property Management, Northern Germany<strong>; Claudia Adão<\/strong>, former Sales Strategy and Operations leader at Amazon and American Airlines joins as Associate Director, Strategy &amp; Planning.&nbsp;<\/p>\n\n\n\n<p>Over the last four years, IMMO has built a powerful tech-led platform that utilises AI and machine learning technology to source, underwrite and structure SFR assets into large portfolios for institutional investors, resulting in stabilised rental income, capital appreciation and best-in-class property management. <\/p>\n\n\n\n<p>Collectively, the new hires will help IMMO enhance their unique end-to-end platform – powered by technology, and managed by on-the-ground experts. <\/p>\n\n\n\n<p>IMMO bolsters its team as it prepares to unlock the $50 trillion residential market in Europe, with almost $2 billion in committed capital to deploy on behalf of some of the largest global investment managers. <\/p>\n\n\n\n<p><strong>Avinav Nigam, COO and co-founder of IMMO, said:<\/strong> <em>“We are partnering with some of the largest global investment managers, having secured $2 billion in capital commitments to be deployed into European Single Family Rentals. I’m excited to welcome exceptional talent from the industry bolstering our team, as we prepare to move into the implementation phase with our capital partners, and fuel our expansion across multiple European markets.<\/em><\/p>\n\n\n\n<p><em>“The proptech sector is heating up as a diverse mix of talents from around the world enter into this growing, fast-paced and challenging space. We have worked hard to build our pan-European platform, and on our journey – that will inevitably unlock the untapped SFR asset class – have sought to source talent that will change the future and nature of the residential investment and rental market for the better.”<\/em><\/p>\n\n\n\n<p>Earlier this year, IMMO – headquartered in the UK <em>–<\/em> welcomed leading real estate strategists and investors Professor Andrew Baum and Todd Ruppert as Strategic Advisors.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>November 2021 – London – IMMO, the tech-enabled end-to-end platform for Single-Family Rental (SFR) investment management, has poached eight new hires across the proptech ecosystem as the company prepares to imminently expand across pan-European countries for the year ahead. The new hires take the overall headcount to 91, up from 45 at the beginning of [&hellip;]<\/p>\n","protected":false},"featured_media":1785,"parent":0,"template":"","tags":[19],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"1441"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1764"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":1,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1764\/revisions"}],"predecessor-version":[{"id":1963,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1764\/revisions\/1963"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/1785"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=1764"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=1764"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=1764"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}