{"id":1911,"date":"2022-01-19T12:31:26","date_gmt":"2022-01-19T12:31:26","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=1911"},"modified":"2022-01-27T14:04:23","modified_gmt":"2022-01-27T14:04:23","slug":"technology-and-data-driven-decision-making-in-the-residential-sector-could-soon-rival-financial-services","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/technology-and-data-driven-decision-making-in-the-residential-sector-could-soon-rival-financial-services\/","title":{"rendered":"Technology and data-driven decision making in the residential sector could soon rival financial services"},"content":{"rendered":"\n<h4 class=\"wp-block-heading\" id=\"proptech-on-the-rise\"><meta charset=\"utf-8\"><strong>Proptech on the rise<\/strong><\/h4>\n\n\n\n<p>Data and technology has become the lifeblood and future of the financial industry. Driven by insights and ambitions, the fintech sector is now a leading example on how technology will impact the future of a ‘modern world’.&nbsp;<\/p>\n\n\n\n<p>This movement of digitisation across leading sectors has now spawned a new generation of fintechs, insurtechs and regtechs that use it to drive better performance and enhance customer experiences. The real estate sector has a long way to go to reach this level of capability, but change is coming with the evolution of proptech. By Q4 2021, a record £15.52bn had been invested in global proptech according to Pi Labs, more than doubling the £7.07bn invested in 2020.<\/p>\n\n\n\n<p>We’re also seeing the real estate industry finally waking up to opportunities for <strong>tech-driven investment tools<\/strong> to enhance areas such as valuations, performance analytics, risk measurement and portfolio stress testing. Many of these tools already exist for optimising investment in equities and fixed income, but the real assets world is just catching up.<\/p>\n\n\n\n<p>The residential sector has particularly lagged behind, largely due to its fragmented ownership. That being said, we’re seeing a major shift in the way properties are bought, sold and rented.<\/p>\n\n\n\n<p class=\"has-h-4-font-size\"><strong>The granularity of residential data provides an immense opportunity<\/strong><\/p>\n\n\n\n<p>With thousands of datasets available—from consumer behaviour to demographics, housing market activity to commuter trends and more—it’s clear that the residential sector has the potential to become the most sophisticated asset class when it comes to data.<\/p>\n\n\n\n<p>You can see this level of granularity when comparing commercial to residential real estate data. If you take €100m of commercial real estate it would likely be a single office block, with a single tenant for 15 years and you might be able to gather 1 or 2 rent reviews during that time period.<\/p>\n\n\n\n<p>€100m in residential real estate by comparison equates to hundreds of units, with tenants churning every 1 to 4 years. So the volume and frequency of data points you can generate compared to commercial real estate is vast, and that’s simply taking reviews into consideration.&nbsp;<\/p>\n\n\n\n<p>There are many more opportunities to draw on data and technology in the residential space.<\/p>\n\n\n\n<p class=\"has-h-4-font-size\"><strong>Data is essential to unlocking single-family rental housing in Europe<\/strong><\/p>\n\n\n\n<p>Data capability has particular importance for the burgeoning single-family rental (SFR) market. For SFR to be a scalable investment option for institutions, it requires a tech-led solution to manage large volumes of data that is then used to assemble sizable portfolios of individual rental units and manage them at scale. Technology is also critical for speeding up the inefficient processes involved in buying and renting these properties.&nbsp;<\/p>\n\n\n\n<p>Given that 98% of the residential asset class is single-family housing that is in a sense &#8216;locked up&#8217; (with the remaining 2% in multi-family and build-to-rent) because it’s owned by private landlords with say 1-10 units, it’s up to technology-led providers to truly unlock the asset class. This is something we’ve seen successfully executed by Invitation Homes, the largest owner of SFR homes in the US, owning approximately 80,000 homes in sixteen US markets. Now, IMMO is leading the way in unlocking access to SFR in Europe.<\/p>\n\n\n\n<p class=\"has-h-4-font-size\"><strong>How does IMMO&#8217;s technology work?<\/strong><\/p>\n\n\n\n<p><a href=\"https:\/\/immo.capital\/investment-process\/\">Our powerful AI-led platform<\/a> has sourced, underwritten, and structured portfolios of dispersed SFR units across cities, delivering consistent and stable yields for our institutional partners. We use tech across the value chain from sourcing SFR units to dispersed portfolio management. This is a business model which would be too operationally and logistically intensive to deliver without a team of data scientists, technologists, and machine learning experts.<\/p>\n\n\n\n<p>Effective data capture, storage and real-time analytics, coupled with the sector’s granularity, provides more flexibility to residential investors. <meta charset=\"utf-8\">When managing rentals, you’re monitoring data points such as refurb budget overruns, late payments of rent or longer-than-expected lease up times for an individual asset. SFR investment technology has the ability to constantly monitor the market and react quickly to any changes. <\/p>\n\n\n\n<p>What’s important to remember is that while tech is used to scale at speed, we also have a team of on-the-ground, local experts that are inspecting properties to identify the best opportunities and also providing an exceptional property management experience. This is something that today’s rental residents not only want, but now expect from a 21st-century landlord. Taking on the entire value chain is no easy feat, but we know that an end-to-end solution is the only way to deliver the best results for both investors and renters.<\/p>\n\n\n\n<p class=\"has-h-4-font-size\"><strong>What’s next for the residential sector?<\/strong><\/p>\n\n\n\n<p>More innovation remains to be seen in the valuation of residential property. As the market continues to transition, the valuation process will be standardised across a large volume of transactions, resulting in higher levels of accuracy and certainty in pricing. Imagine our homes being valued based on thousands of standardised factors, rather than the subjective market-led prices we buy, sell and rent at today.<\/p>\n\n\n\n<p>Some real estate companies are starting to transition into truly tech-led businesses, with data at the forefront of all decision making. Combine this trend with the knowledge that residential real estate is the largest asset class in the world (a $50 trillion market in Europe alone), and you can clearly see the massive opportunity this presents. It will be exciting to watch how sophisticated data handling will transform investment and ownership in property.<\/p>\n\n\n\n<p>Tech-enabled efficiencies will lead the charge in professionalising the way we interact with real estate across all aspects of the value chain — it’s all eyes on residential.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Proptech on the rise Data and technology has become the lifeblood and future of the financial industry. Driven by insights and ambitions, the fintech sector is now a leading example on how technology will impact the future of a ‘modern world’.&nbsp; This movement of digitisation across leading sectors has now spawned a new generation of [&hellip;]<\/p>\n","protected":false},"featured_media":1751,"parent":0,"template":"","tags":[],"article_category":[27],"cmb2":{"feature_metabox":{"feature_blog":""},"custom_author_metabox":{"custom_author_id":"534"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1911"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":15,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1911\/revisions"}],"predecessor-version":[{"id":1980,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/1911\/revisions\/1980"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/1751"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=1911"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=1911"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=1911"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}