{"id":2002,"date":"2022-02-01T13:02:02","date_gmt":"2022-02-01T13:02:02","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=2002"},"modified":"2022-02-01T13:02:03","modified_gmt":"2022-02-01T13:02:03","slug":"why-we-stopped-calling-ourselves-a-landlord-and-our-customers-tenants","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/why-we-stopped-calling-ourselves-a-landlord-and-our-customers-tenants\/","title":{"rendered":"Why we stopped calling ourselves a landlord, and our customers tenants"},"content":{"rendered":"\n<h4 class=\"wp-block-heading\" id=\"it-s-time-for-real-estate-to-serve-its-customers\">It’s time for real estate to serve its customers<\/h4>\n\n\n\n<p>What’s in a name? At a glance, it’s easy to dismiss recent surveys of <a href=\"https:\/\/www.landlordzone.co.uk\/news\/its-time-to-stop-calling-ourselves-landlords-buy-to-let-poll-reveals\/\">UK landlords<\/a> calling to retire the term ‘landlord’ as cosmetic attempts to distance themselves from negative press. Indeed, the survey results decried landlords being unfairly portrayed as scary financial bogeymen, and pointed to a ‘rebrand’ as the solution. Is it then that the private rented sector in Europe is without problems, since the local vocabulary on the continent is often closer to the neutral ‘lessor’ and ‘lessee’ than the medieval ‘landlord’ and ‘tenant’?<\/p>\n\n\n\n<p>It’s perhaps more revealing to examine what’s underneath a name. I always found it intriguing to think of real estate in the context of basic human needs like food, healthcare, clothing, and shelter. It’s a telling perspective: the first three sectors are highly organised, even scientific in how they develop products, and their customers’ rights are tightly protected by regulatory oversight and pressure from professional competition. This is far from the case in real estate, where the industry is still, in 2022, having conversations about treating tenants as customers, and focusing on tenant satisfaction.<\/p>\n\n\n\n<p>It just so happens that these problems run so deep that they also show up in the basic wording we use in renting. It’s true that ‘tenant’ and ‘landlord’ are feudal, medieval terms that describe a subservient relationship between an underrepresented subject and a noble owner. The balance of power in renting today is less severe than a couple of centuries ago, but still persists in different ways. Tenants see little protection besides basic appliance safety standards and tenancy agreements regulations that many landlords still try to circumvent. The growing population of renters is clearly affected by externalities like interest rates, housing prices, and mortgage markets that bar more people from home ownership and force them into a rental market where their bargaining power is severely limited by an insufficient supply of adequate housing and many tenants have to settle for subpar or overpriced homes.<\/p>\n\n\n\n<p>This state of affairs is far from IMMO’s vision for renting: <\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-default\"><p>We believe everyone deserves adequate, sustainable high quality housing and reliable, professional, transparent care by the provider of that housing. <\/p><\/blockquote>\n\n\n\n<p><\/p>\n\n\n\n<p>We strive to do that for people who rent from us, and it became clear that we too did not want to be associated with unfair ways of working reflected by wording still rooted in the middle ages. <\/p>\n\n\n\n<p>At the same time, IMMO serves more than one group of customers, so this was not the most straightforward rebrand for us. As we revamp the entire category of housing, our customers involve institutional investors who previously had no way to deploy capital at scale into the single family rental (SFR) housing market in Europe; home sellers for whom we make a traditionally slow, opaque, and costly process fast and transparent; partner brokers for whom we’re a fast-acting, professional buyer; and finally the people who take up their residence in the homes we upcycle into modern, affordably priced properties. After thoughtfully considering our entire customer-base, the choice of wording became clear &#8211; our rental customers thus became our ‘residents’, and ourselves, far from the passive landlord, became their ‘housing provider’. I personally liked how this name rhymed with utility providers &#8211; companies that face a responsibility and duty to provide a consistent, trustworthy service that fulfills such a basic need for their customers. The name also clearly showed us how we have to go beyond providing just housing; we need to build a reliable layer of additional services connected to the home. Things that residents often already need or engage with &#8211; like security deposits, utility contracts, furniture, removals &#8211; but despite these being clearly connected to their rented home, residents are often left to fend for themselves and deal with a variety of vendors, each with their own little inefficiencies.<\/p>\n\n\n\n<p>Our view is that the whole industry needs to become more professional and more organised, moving towards working with shared, transparent data and towards an ecosystem of connected products and services. It’s a similar shift to how fintech companies shook a stale banking industry to deliver better deals and more convenience for customers while creating new jobs and opportunities. I believe this has been started by the first waves of proptech companies that look to digitise an industry still largely based on paper, but the change needs to go much deeper, and address the fundamentals of real estate &#8211; like the relationship between lessees and the often unprofessional lessors they rent from.<\/p>\n\n\n\n<p>Change is a gradual process. Retiring words that no longer reflect how we think, like ‘tenants’ or ‘landlords’ in favour of ‘residents’ and ‘housing providers’, is certainly part of this process of changing real estate, and making housing work better for everyone.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s time for real estate to serve its customers What’s in a name? At a glance, it’s easy to dismiss recent surveys of UK landlords calling to retire the term ‘landlord’ as cosmetic attempts to distance themselves from negative press. Indeed, the survey results decried landlords being unfairly portrayed as scary financial bogeymen, and pointed [&hellip;]<\/p>\n","protected":false},"featured_media":2006,"parent":0,"template":"","tags":[31,32,30],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"1897"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2002"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":3,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2002\/revisions"}],"predecessor-version":[{"id":2005,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2002\/revisions\/2005"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/2006"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=2002"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=2002"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=2002"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}