{"id":2036,"date":"2022-03-04T12:25:18","date_gmt":"2022-03-04T12:25:18","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=2036"},"modified":"2022-03-04T12:25:19","modified_gmt":"2022-03-04T12:25:19","slug":"the-future-of-housing-delivery-is-circular","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/the-future-of-housing-delivery-is-circular\/","title":{"rendered":"The future of housing delivery is circular"},"content":{"rendered":"\n<p>Where others see waste, we see opportunity. According to the Danish Energy Agency, construction and demolition account for 25–30 percent of all waste generated in the EU. Those construction activities also emit gasses with global warming potential, with cement and steel production being close to 10 percent of global CO<sub>2<\/sub> emissions.<\/p>\n\n\n\n<p>There is a class of problems called ‘wicked problems’ which are deemed to be among the most complex of our time. The housing crisis could be argued on its own to belong to this set of problems. Resolving the housing crisis without incurring an environmental crisis certainly does.<\/p>\n\n\n\n<p>Doubtless we could build more housing, even if the <em>how<\/em> proves elusive. Housebuilding at scale is clearly a huge contributor to meeting housing need, but it entails a significant withdrawal against the UK’s already tight carbon budget. Moreover, <a href=\"https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1045866\/Housing_Supply_Indicators_Sep_2021.pdf\">according to the latest statistics<\/a>, we are still undershooting these targets by a margin of at least 50,000<a id=\"_ftnref1\" href=\"#_ftn1\"><sup>[<\/sup><\/a>annually and arguably we <a href=\"https:\/\/commonslibrary.parliament.uk\/research-briefings\/cbp-7671\/\">need greater housing supply<\/a> than that to resolve some of the systemic issues with affordability and availability.<a id=\"_ftnref2\" href=\"#_ftn2\"><sup>[2]<\/sup><\/a><\/p>\n\n\n\n<p>By building new housing at scale using traditional methods, we risk a number of environmental impacts: making construction materials uses resources and energy and we have to find suitable land to build upon.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/immo.capital\/wp-content\/uploads\/2022\/03\/Info_Immo-01-3-1640x855.jpg\" alt=\"\" class=\"wp-image-2042\" width=\"1001\" height=\"521\" srcset=\"https:\/\/immo.capital\/wp-content\/uploads\/2022\/03\/Info_Immo-01-3-1640x855.jpg 1640w, https:\/\/immo.capital\/wp-content\/uploads\/2022\/03\/Info_Immo-01-3-698x364.jpg 698w, https:\/\/immo.capital\/wp-content\/uploads\/2022\/03\/Info_Immo-01-3-327x170.jpg 327w, https:\/\/immo.capital\/wp-content\/uploads\/2022\/03\/Info_Immo-01-3-451x235.jpg 451w, https:\/\/immo.capital\/wp-content\/uploads\/2022\/03\/Info_Immo-01-3.jpg 1920w\" sizes=\"(max-width: 1001px) 100vw, 1001px\" \/><\/figure><\/div>\n\n\n\n<p><\/p>\n\n\n\n<p><a href=\"https:\/\/www.ons.gov.uk\/peoplepopulationandcommunity\/birthsdeathsandmarriages\/families\/bulletins\/familiesandhouseholds\/2020\">According to the Office for National Statistics<\/a><span style=\"background-color: inherit; color: inherit; font-size: 1.125rem;\">, the most common family type remains civil and married partnered couple families, with a further proportion of couples choosing to live together with or without getting married. In 2020, there were 19.4m families in the UK, with a 7.4 percent increase over the decade 2010 to 2020. If we cannot deliver new housing to meet this growing demographic, how else can we meet that demand?<\/span><\/p>\n\n\n\n<p>Statistics on homes in disuse are not widely disaggregated, but <a href=\"https:\/\/www.bigissue.com\/news\/housing\/how-many-empty-homes-are-there-in-the-uk\/\">according to the latest figures<\/a>, there were 268,385 long-term empty homes in the UK in 2020<span style=\"background-color: inherit; color: inherit; font-size: 1.125rem;\">. The volume of under-utilised homes is likely to grow as new regulations come in, in particular as energy efficiency requirements become more stringent. For example, when the Minimum Energy Efficiency Standard in the UK increases to C, it is anticipated that many rental properties will become obsolete as their owners cannot or will not allocate the budget, time and energy required to upgrade their properties.<\/span><\/p>\n\n\n\n<p>Moreover, the <a href=\"https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/945013\/2019-20_EHS_Headline_Report.pdf\">Building Research Establishment estimates<\/a> that poor housing costs the NHS at least £1.4 billion per year, and the most severe category of health hazards existed in 10 percent of the housing stock.<a id=\"_ftnref5\" href=\"#_ftn5\"><sup>[<\/sup><\/a>Further to this, 17 percent or 4.1m homes failed to meet the Decent Homes Standard in 2019<a id=\"_ftnref6\" href=\"#_ftn6\"><sup>[6]<\/sup><\/a> meaning that they held health risks for occupants, lacked modern facilities and\/or did not have suitable thermal comfort. The latter has been put into stronger emphasis with energy prices due to rise this year <a href=\"https:\/\/www.which.co.uk\/news\/2022\/02\/energy-bills-to-rise-by-693-for-22-million-people-in-april-2022\/\">by around £700<sup>[<\/sup>per household<\/a>, finances for many families will be stretched if they already live in leaky, energy inefficient homes.<\/p>\n\n\n\n<p>While we could build more housing, when we think about housing need, we need to think (and crucially, do something) about how we can use the housing we have more effectively. Since houses get replaced relatively slowly, they become worn and entrench design decisions that may not fit well with the way we live now. For example, 76 percent of housing in England was built before building regulations required insulation.<\/p>\n\n\n\n<p>Around half of the carbon emissions associated with the 80 Mtonnes CO<sub>2<\/sub> that accompanies construction of a new house is embodied in the structure and foundations. In the waste hierarchy, avoidance of waste should be considered as a first and preferred option. This finds ways to use existing resources over longer timescales, avoids sending materials to landfill and avoids the energy and emissions associated with their renewal and replacement. Only if this is not feasible should recycling or sending materials to landfill be considered. If we save the structure and foundations of an existing house, we not only save emissions but also prevent waste to landfill.<\/p>\n\n\n\n<p>Due to highly fragmented home ownership, it has historically been difficult for the up-cycling of existing homes to be undertaken at scale, especially in the rental market where it is at the discretion of individual landlords. The growth of emerging housing models such as build-to-rent and single family rentals (SFR) is a key catalyst for this to change, with institutional funds boosting spending on sustainability within the housing market. The SFR model, in particular, has some interesting parallels with circular economy principles as homes that are acquired typically undergo thoughtful refurbishment and sustainability-focussed modernisation, before being rented out on the market.<\/p>\n\n\n\n<p>There are multiple ways in which an existing home can be up-cycled through modern materials, design and technology to not only make it a welcoming and cost-efficient home for long term renters. Some examples of effective retrofitting strategies include using only timber and timber-based products certified under the Forest Stewardship Council (FSC) or similar, working with manufacturers that are carbon neutral or have high sustainability credentials, ensuring all waste is recycled and adding appliances and boilers that have a high energy efficiency rating.<\/p>\n\n\n\n<p>Further, by using circular design principles, we can use fittings, services and construction principles that enable us to retrofit housing such that materials can be reused and repurposed. We can also avoid the loss of scarce and rare materials through appropriate design for separation. This presents a holistic approach toward carbon mitigation in housing and avoids emissions leakage on the road to net zero emissions.<\/p>\n\n\n\n<p>The SFR market and its association with the circular economy is one of many key drivers behind the recent heightened interest in the sector amongst institutional investors. Repurposing existing housing offers an opportunity to leverage institutional investment in retrofit at a time when Government funding for retrofitting is scarce. This is in spite of the fact that the vast majority of the UK’s 27 million homes will need to be made virtually net zero by 2050.<\/p>\n\n\n\n<p>Not only does this approach add to the value of the asset for investors, but also creates more energy efficient homes that will serve to reduce environmental impacts – and associated resident costs – for years to come. Forward-thinking investors are unsurprisingly taking a closer look at SFR investing, not just because it offers access to diversified, stabilised and income-producing residential portfolios, but also to play a role in revolutionising the resident experience, keeping neighbourhoods intact and creating places that people can be proud to call home – without the carbon cost of demolition and construction.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Where others see waste, we see opportunity. According to the Danish Energy Agency, construction and demolition account for 25–30 percent of all waste generated in the EU. Those construction activities also emit gasses with global warming potential, with cement and steel production being close to 10 percent of global CO2 emissions. There is a class [&hellip;]<\/p>\n","protected":false},"featured_media":2050,"parent":0,"template":"","tags":[35,36,34],"article_category":[27,33],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"1863"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2036"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":10,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2036\/revisions"}],"predecessor-version":[{"id":2047,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2036\/revisions\/2047"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/2050"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=2036"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=2036"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=2036"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}