{"id":2060,"date":"2022-04-12T14:43:56","date_gmt":"2022-04-12T14:43:56","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=2060"},"modified":"2022-04-15T12:27:54","modified_gmt":"2022-04-15T12:27:54","slug":"solving-the-residential-real-estate-category-announcing-immos-75-million-fundraise-the-largest-ever-proptech-series-b-in-europe","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/solving-the-residential-real-estate-category-announcing-immos-75-million-fundraise-the-largest-ever-proptech-series-b-in-europe\/","title":{"rendered":"Solving the residential real estate category: announcing IMMO’s $75 million fundraise, the largest ever proptech Series B in Europe"},"content":{"rendered":"\n<p>When we founded IMMO in 2017, our ambition was to address the only fundamental human need that is still not served by a professional consumer industry: housing.<\/p>\n\n\n\n<p>We started diving into the issue and discovered near infinite complexity from every angle. The challenges begin with what is for buyers the largest purchase of their life and for renters the biggest expense from their monthly paycheck. Buying and selling homes is an extremely volatile transaction, where most sales fall through due to uncertainty on the side of the buyer. At the same time, renting continues to consume ever larger chunks of household budgets in exchange for limited choice and a rental product that has barely changed or adapted to the developing needs of consumers over the past 50 years. Renters often face poor quality housing in a market overwhelmingly controlled by brokers or dominated by private, non-professional landlords.<\/p>\n\n\n\n<p>The challenges in the housing industry also touch some of the largest problems of our lifetime. Construction of new homes is a massive contributor to pollution, while a growing population of renters, today up to 85% in European urban areas, continue to pump money into a sector that does not connect to their long-term planning and savings.<\/p>\n\n\n\n<p>Meanwhile, pension funds themselves, like other large financial institutions and passive capital allocators, cannot access 98% of the residential real estate market: the single family rental asset class. Institutions could historically not deploy capital into the vast majority of the housing market due to fragmented data, lack of transparency, and the sheer scale that exceeds any human being’s capabilities for market intelligence and sourcing investments.<\/p>\n\n\n\n<p>To us, the housing problem was, and is, much more than fixing a process or changing industry. It is about changing an entire category and rewriting a social contract.<\/p>\n\n\n\n<p>We looked to technology to help us do this, and with the help of an incredibly talented team spanning expertise across real estate, finance, data, product, and engineering, we’ve built Europe’s first tech-driven single family residential investment platform. Our tech leverages machine learning and AI. This allows us to analyse billions of Euros in property leads generated from proprietary D2C channels, brokers, and listing platforms, then consolidate and examine data sources to gain complete market coverage and identify the right investment opportunities for us to purchase, sustainably upcycle, and rent out to residents at affordable prices paired with round the clock customer care. We’ve proven our model in Germany to large capital investors, seen the model withstand a global pandemic, and achieved 1,200% business growth in the last 6 months.<\/p>\n\n\n\n<p>That’s why today I am incredibly proud to announce that IMMO has raised $75 million in Series B equity funding, led by Oak HC\/FT, a US based venture and growth equity fund investing in healthcare and fintech, alongside Moore Speciality Credit and our existing investors FinTech Collective and Talis Capital. Together with the equity fundraise, we raised $2.5 billion in commitments from leading institutional investors to create single family residential portfolios at a scale never seen before in Europe. The incredible capital mandates, together with what constitutes Europe’s largest ever Proptech Series B transaction to date, allow us to begin the next phase of our thrilling mission:<\/p>\n\n\n\n<ul><li>We’re building out our AI, machine learning, and data capabilities to tackle complexity across new European markets, addressing one of the key transparency challenges of real estate in Europe. Each country, market and each jurisdiction sees disjoint data sources, disparate challenges to deal availability, and different legal and business frameworks that mean our tech has to adapt fast, in lean iteration cycles like the best scalable tech firms in the world.<\/li><li>We’re expanding our tech offering for home sellers and residents, building consumer facing platforms that let us stay close to user needs, tackle more inefficiencies in a traditionally labour-intensive industry, and pioneer a ‘living-as-a-service’ model where homes are connected to a digital ecosystem of products and services<\/li><li>We’re accelerating creating housing that consumers love, aiming to source, acquire, and refurbish a further 10,000 homes in Germany, Spain, and internationally, with less than half of the emissions of comparable new build, letting us tackle Europe’s housing crisis more sustainably.<\/li><li>We’re hiring new roles across Germany, Spain, internationally, and remotely to grow our amazing team that already includes passionate people coming from a truly vibrant mix of 16 nationalities and varied professional backgrounds including established institutions like Blackstone, Goldman Sachs, Blackrock and world-famous tech companies like Uber, Google, and Amazon.<\/li><\/ul>\n\n\n\n<p>As we look to what is undoubtedly a thrilling future, I can’t not thank the people who have brought us here. In particular I would like to thank my co-founders Samantha Kempe, Avinav Nigam, and Wouter van der Gaag for their commitment towards IMMO over the past years; and extend a heartfelt thank you to our team for their incessant hard work that has built our technology, built the homes our residents enjoy, and builds what I am so very proud to call the happiest workplace I have ever experienced in my professional life.<\/p>\n\n\n\n<p>Thank you!<br>Gigi<br><br>&#8212; <br><br>Hans-Christian “Gigi” Zappel<br>IMMO Co-Founder &amp; CEO<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When we founded IMMO in 2017, our ambition was to address the only fundamental human need that is still not served by a professional consumer industry: housing. We started diving into the issue and discovered near infinite complexity from every angle. The challenges begin with what is for buyers the largest purchase of their life [&hellip;]<\/p>\n","protected":false},"featured_media":2067,"parent":0,"template":"","tags":[],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":"on"},"custom_author_metabox":{"custom_author_id":"532"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2060"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":3,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2060\/revisions"}],"predecessor-version":[{"id":2069,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2060\/revisions\/2069"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/2067"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=2060"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=2060"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=2060"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}