{"id":2744,"date":"2023-04-04T13:43:25","date_gmt":"2023-04-04T13:43:25","guid":{"rendered":"https:\/\/immo.capital\/?post_type=article&#038;p=2744"},"modified":"2023-04-04T13:44:28","modified_gmt":"2023-04-04T13:44:28","slug":"code-like-a-proptech-github-copilot-and-chatgpt-boosting-developer-efficiency-at-immo","status":"publish","type":"article","link":"https:\/\/immo.capital\/article\/code-like-a-proptech-github-copilot-and-chatgpt-boosting-developer-efficiency-at-immo\/","title":{"rendered":"Code Like a Pro(ptech): GitHub Copilot and ChatGPT Boosting Developer Efficiency at IMMO"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Introduction<\/h2>\n\n\n\n<p>At IMMO, we&#8217;re always on the lookout for strategies to boost our efficiency and productivity. We&#8217;ve recently managed to do this by tapping into the potential of GitHub Copilot and ChatGPT. These AI-driven tools have proven invaluable in our day-to-day development tasks, enabling us to optimise our processes and enhance our software offerings. In this blog post, we&#8217;ll delve into some of the ways we integrate these tools into our development process to empower our developers and share some of our favourite use cases &#8211; true to our motto of “powered by machines, managed by experts.”<\/p>\n\n\n\n<p>Before we dive deep, let&#8217;s quickly recap what GitHub Copilot and ChatGPT are all about. GitHub Copilot is an AI-powered coding partner that generates code and full functions in real-time, directly within your favourite editor, helping developers create code more quickly and with reduced errors. OpenAI&#8217;s ChatGPT, on the other hand, is a well-known large language model (LLM) that hardly needs an introduction. With its training on a massive amount of text data, it&#8217;s able to understand and generate text that closely mimics human language, and in this particular case, code.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Transformative impact on engineering workflow<\/h2>\n\n\n\n<p>Since incorporating GitHub Copilot and ChatGPT into our workflow, one of the most notable benefits we&#8217;ve observed is the <strong>accelerated code generation<\/strong> to solve specific challenges, surpassing the conventional Google search and Stack Overflow browsing approach. As Andrej Karpathy highlighted in his <a href=\"https:\/\/twitter.com\/karpathy\/status\/1608895189078380544\">tweet<\/a>, Copilot has evolved into a crucial component of the software development stack, assisting developers with code autocompletion and expediting the development process.<\/p>\n\n\n\n<p>Let&#8217;s take a look at a few examples through the lens of implementing a delete button with a confirmation dialog in React using Copilot (code based on this <a href=\"https:\/\/twitter.com\/francoisz\/status\/1409919670803742734?s=20\">tweet<\/a>).&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh6.googleusercontent.com\/DQi4VWfgvnCcT4QmljoUp6l70ayComG4XWGTURCWzs50M-OulFt3lFpcMJhXUcjvZsgJfsL51cuMmaQRxr6ddbRm9f-rArGUDQSAb4jbhYZWnXoQUdbYWaOz2qLiBLreMdMiIffr3ugmLB2B8djKdWo\" alt=\"\"\/><\/figure>\n\n\n\n<p>After typing just a few characters, Copilot makes surprisingly accurate suggestions on how to autocomplete the code block: not just lines but whole functions. Alternatively, we can simply add a comment block for a function we want to develop, and Copilot automatically provides helpful suggestions in light grey text. The developer is continuously steering and prompting the AI tool, but effectively 80% of the code is generated, ready for the developer to review.<br><\/p>\n\n\n\n<p>Here’s the full code of the generated confirmation dialog React component. We’ll be using this to illustrate some of our favourite ChatGPT use-cases below.<br><\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"601\" height=\"822\" src=\"https:\/\/immo.capital\/wp-content\/uploads\/2023\/04\/Screenshot-2023-04-04-at-14.39.20.png\" alt=\"\" class=\"wp-image-2749\" srcset=\"https:\/\/immo.capital\/wp-content\/uploads\/2023\/04\/Screenshot-2023-04-04-at-14.39.20.png 601w, https:\/\/immo.capital\/wp-content\/uploads\/2023\/04\/Screenshot-2023-04-04-at-14.39.20-327x447.png 327w, https:\/\/immo.capital\/wp-content\/uploads\/2023\/04\/Screenshot-2023-04-04-at-14.39.20-451x617.png 451w\" sizes=\"(max-width: 601px) 100vw, 601px\" \/><\/figure>\n\n\n\n<p><br><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><br>ChatGPT has proven particularly effective at explaining complex or unfamiliar code. IMMO software developers have leveraged these tools to improve their understanding of code and <strong>bridge knowledge gaps<\/strong>. As an example, consider a sample prompt that generates a plain English explanation of the functionality of our delete button React component.<\/p>\n\n\n\n<p>Prompt:<\/p>\n\n\n\n<p>What will the following code snippet do {enter code}<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh5.googleusercontent.com\/17VKnwkUCk2n6q1KK5gUDRVSc4ld15TxCOK800WBeed8TqZHpI-6kxCZ4pijQnqngOE1r-rQPoDgk4SmcLi6YAkAg8kFu86RwcVSZI3fjq9qn9jAld0v1PVQd1Qm4bhq_n-az0W27K9U1rnEwvea78g\" alt=\"\"\/><\/figure>\n\n\n\n<p>Here at IMMO, we believe that the finest code is code that speaks for itself. We recognise the value of adding comments to enable our teammates to grasp the purpose and function of the code without needing to switch context and reference additional documentation. The advent of ChatGPT has been a game changer in this regard, as it <strong>effortlessly generates inline comments<\/strong> for our developers to review. In case of an error in the suggested comments, a quick correction ensures that the code remains well documented and seamlessly accessible for the next engineer to engage.<\/p>\n\n\n\n<p>Prompt:<\/p>\n\n\n\n<p>Regenerate the code snippet below, but please include comments to each line of code {enter code}<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh6.googleusercontent.com\/FGNynhaRbeh7XmUMB6IfEcLZ0KOr2RbDSvqjkr8zy4I6olDNh7Ey-ibNAgHSWbgD68IoBocbH7bSZvq3FX_Mmwdh7MUQF_F22VHBzdVyn1M57gIDwYXbZfq5Pa3yMf7HknZp0NPoNrwJtCjgAtVTThw\" alt=\"\"\/><\/figure>\n\n\n\n<p>We can further enhance the quality of our code through the <strong>automatic generation of unit and end-to-end tests<\/strong>. In the past, the responsibility of crafting unit tests rested solely on the shoulders of the testing team, resulting in a less-than-optimal workflow with frequent handovers and cumbersome dependencies that could lead to bottlenecks. However, with the advent of developer-centric unit testing, we can now achieve a streamlined process that empowers developers to deliver robust tests as part of their story completion. Here’s an example of a prompt we use to generate a unit test draft for our React component:<\/p>\n\n\n\n<p>Prompt:<\/p>\n\n\n\n<p>Write test cases for the main edge cases that could happen to the below code snippet. First outline the test cases you&#8217;ll write. Second, write the test cases in javascript using the Jest framework. {enter code}<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh4.googleusercontent.com\/H-FbfnUbOP4LVjC6-eYO5WhaQiIRTDU-aoMIVYJcbKBUErwrBxXoBnOmoqTJBOehqEXJGpvLh_fAwsqJ7Vz1usFMl3dBOr3NV423SiNKMZNOmaGUyasW8X87sgnAtBPLEG7-AEj_wlaQBsn17rKLjcQ\" alt=\"\"\/><\/figure>\n\n\n\n<p>ChatGPT also enables <strong>automatic translation between languages and frameworks<\/strong>, ensuring seamless integration across our diverse tech stack. Most notably, we were able to convert components written in React Native to React while simultaneously transitioning the UI library from React Native Paper to React Bootstrap. Furthermore, we could execute the generated React Native code without requiring any manual modifications.<\/p>\n\n\n\n<p>Prompt:<\/p>\n\n\n\n<p>Translate the code below from React to React Native whilst changing the UI library from material-ui\/core to react-native-paper {enter code}<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh4.googleusercontent.com\/TYYD6RTLJxftkGkNR6wrQU4FOSvvr0tYrDuEE8H0yDuYAbwk8s6dAnrYNEedaLMQQL_h7bHyTGrRy5R4nBk7s_8H3_hwlFSFe7tOVTy1iR5d35wEwrG_Dt9HdtZYmqUhqBifZTEgt5DKVW9kjYm-8KQ\" alt=\"\"\/><\/figure>\n\n\n\n<p><br>Another excellent application of ChatGPT is the efficient creation of SQL statements based on English descriptions, which streamlines data transactions and manipulation. It can also function as an SQL simulator, generating tables populated with test data in seconds, enabling developers to rapidly <strong>prototype and evaluate queries<\/strong>:<\/p>\n\n\n\n<p>Prompt:<\/p>\n\n\n\n<p>The database contains tables named &#8220;Buildings&#8221;, &#8220;Residents&#8221;, &#8220;TenancyAgreements&#8221; and &#8220;Investors.&#8221; I will type queries, and you will reply with what the terminal shows. I want you to reply with a table of query results in a single code block.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh5.googleusercontent.com\/MsplkfPZiN4cElV80jtD3lqTJkHxGvNqPIO8x3VmQlQSD1c9p5PTAZtcbFV9RJTdl6JELEf0bk2_02gRAS1Q2gH71LWESsTpDli3maqreN3GeUCQb-FqwbX65XzSMDq2M2WqBqPQ6XZohD4nU0omXRk\" alt=\"\"\/><\/figure>\n\n\n\n<p><br>We’ve found that ChatGPT can not only bolster the resilience and security of our code but can also be used to facilitate the dissection of large components into smaller, more digestible fragments. ChatGPT’s prowess in debugging and rectifying errors is remarkable, as it pinpoints potential issues and recommends suitable fixes.&nbsp;<\/p>\n\n\n\n<p>We have also successfully leveraged ChatGPT in some unusual use cases such as transforming REST API specification into GraphQL schemas and auto generating regular expressions for data scraping based on a few unstructured samples.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Things to Keep in Mind<\/h2>\n\n\n\n<p>Are these AI-powered coding tools the holy grail that replaces the developer&#8217;s role in software development? Absolutely not. Let&#8217;s be clear, what we have here are sophisticated machine learning models, trained on vast amounts of code, capable of translating natural language inputs into programming suggestions.<\/p>\n\n\n\n<p>While ChatGPT and GitHub Copilot have tremendous potential, we must remain mindful of their limitations. One of the major concerns is the issue of hallucination, where the suggestions generated by the AI may not always be accurate or reliable. Therefore, it&#8217;s crucial that developers exercise caution and scrutinise the output generated by these tools. Software engineers should always <strong>verify the code<\/strong> themselves to ensure that it aligns with their intended logic. While AI tools can be helpful, they are not a replacement for a developer&#8217;s judgement. It is crucial that engineers invest the effort to understand how the code functions, as <strong>they remain ultimately in control and accountable<\/strong>. Furthermore, we at IMMO maintain our existing quality assurance measures, such as peer reviews, to mitigate the risk of any unintended consequences.<\/p>\n\n\n\n<p>Another critical consideration when using these tools is GDPR compliance. If you&#8217;re working with customer data that contains Personally Identifiable Information (PII), you should avoid inputting it into ChatGPT as it is <strong>not GDPR compliant<\/strong>. OpenAI employees can access your prompts to debug and refine models and add them to their training dataset, which may pose a risk to your customers&#8217; data privacy.<\/p>\n\n\n\n<p>Most recently Italy has <a href=\"https:\/\/techcrunch.com\/2023\/03\/31\/chatgpt-blocked-italy\/\">temporarily blocked ChatGPT<\/a> due to data protection concerns, as there are allegations that OpenAI has unlawfully processed users&#8217; data. We at IMMO take these concerns seriously, especially given OpenAI&#8217;s admission that a conversation history feature may have inadvertently leaked users&#8217; chats and potentially exposed their payment information. It is crucial that every company remains cautious and prioritises the protection of users&#8217; data.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion<\/h2>\n\n\n\n<p>At IMMO, we have experienced a paradigm shift in our development processes, thanks to the game-changing capabilities of ChatGPT and GitHub Copilot. These AI tools have not only accelerated our workflow but also contributed to our ability to deliver high-quality software solutions. By understanding their strengths, limitations, and risks, developers can harness the power of these AI assistants to improve their workflows and achieve impressive results, even with a lean team.<\/p>\n\n\n\n<p>Looking ahead to the future, we can anticipate even more remarkable AI innovations. In the not-too-distant future, we may witness the first-draft of code generated automatically by AI, based on a well-crafted user story. As a result, software development could shift into a new phase of reviewing and prompting, representing the next level of abstraction in the software development process.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Introduction At IMMO, we&#8217;re always on the lookout for strategies to boost our efficiency and productivity. We&#8217;ve recently managed to do this by tapping into the potential of GitHub Copilot and ChatGPT. These AI-driven tools have proven invaluable in our day-to-day development tasks, enabling us to optimise our processes and enhance our software offerings. In [&hellip;]<\/p>\n","protected":false},"featured_media":2752,"parent":0,"template":"","tags":[19],"article_category":[],"cmb2":{"feature_metabox":{"feature_blog":""},"custom_author_metabox":{"custom_author_id":"2741"}},"_links":{"self":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2744"}],"collection":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article"}],"about":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/types\/article"}],"version-history":[{"count":6,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2744\/revisions"}],"predecessor-version":[{"id":2751,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article\/2744\/revisions\/2751"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media\/2752"}],"wp:attachment":[{"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/media?parent=2744"}],"wp:term":[{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/tags?post=2744"},{"taxonomy":"article_category","embeddable":true,"href":"https:\/\/immo.capital\/wp-json\/wp\/v2\/article_category?post=2744"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}